package com.baidu.android.common.util;

import android.util.SparseArray;
import androidx.core.view.InputDeviceCompat;
import com.baidu.android.common.others.lang.StringUtil;
import com.baidu.titan.sdk.runtime.ClassClinitInterceptable;
import com.baidu.titan.sdk.runtime.ClassClinitInterceptorStorage;
import com.baidu.titan.sdk.runtime.FieldHolder;
import com.baidu.titan.sdk.runtime.InitContext;
import com.baidu.titan.sdk.runtime.InterceptResult;
import com.baidu.titan.sdk.runtime.Interceptable;
import com.baidu.titan.sdk.runtime.TitanRuntime;
import com.baidu.yunjiasu.ping.Ping;
import java.util.ArrayList;
import java.util.Arrays;
import kotlin.jvm.internal.CharCompanionObject;
/* loaded from: classes10.dex */
public class HanziToPinyin {
    public static /* synthetic */ Interceptable $ic = null;
    public static final boolean DEBUG = false;
    public static final String FIRST_PINYIN_UNIHAN = "吖";
    public static final char FIRST_UNIHAN = 11905;
    public static final String HANZI = "厑吖啊嗄錒锕阿伌僾凒叆哀哎唉啀嗌嗳嘊噯埃塧壒娭嫒嬡愛懓挨捱昹暧曖毐溰溾爱瑷璦癌皑皚皧瞹矮砹硋碍艾蔼薆藹譪躷鎄鑀锿隘霭靄靉馤魞鱫鴱﨟侒俺儑厈咹唵啽垵埯堓安岸峖庵按揞暗案桉氨犴痷盦盫罯胺腤荌菴萻蓭誝谙豻貋銨錌铵闇隌雸鞌鞍韽馣鮟鹌黯卬岇昂昻枊盎肮醠骯傲凹厫嗷嗸坳垇奡奥奧媪嫯岙岰嶅嶴廒慠懊擙敖柪滶澚澳熬爊獒獓璈翱翶翺聱芺蔜螯袄襖謷謸軪遨鏊鏖镺隞骜鰲鳌鷔鼇丷仈八叐叭吧哵坝坺垻壩夿岜巴弝扒扷把抜拔捌朳欛灞炦爸玐疤癹矲笆粑罢罷羓胈芭茇菝蚆覇豝跋軷釟钯霸靶魃鲃鲅\ue83c\ue83d佰唄拜拝挀捭掰摆擺敗柏栢瓸白百稗竡粨粺絔薭贁败伴办半坂姅岅怑扮扳拌搬攽斑斒昄板柈版班瓣瓪瘢癍秚籓粄絆绊舨般蝂辦辬鈑鉡钣闆阪靽颁魬傍垹塝帮幇幚幫捠搒梆棒榜浜玤磅稖綁縍绑膀艕蒡蚌蜯謗谤邦邫镑鞤佨保儤勹勽包堡堢媬孢宀宝寚寳寶忁怉报抱暴曓曝枹煲爆珤窇笣緥胞苞菢葆蕔薄藵虣蚫袌裦褒褓豹賲趵鑤闁雹靌靤飹飽饱駂骲髱鮑鲍鳵鴇鸨齙龅䎱俻倍偝偹備僃北卑呗备孛悖悲惫愂憊揹昁杯桮梖棓焙牬犕狈狽珼琲盃碑碚禙糒背苝蓓藣蛽被褙襬誖貝贝軰輩辈邶鄁鉳鋇鐾钡陂鞴骳鵯鹎倴喯坌夲奔奙捹撪本栟楍泍渀犇畚笨翉苯贲逩錛锛嘣埲塴崩嵭揼泵琫甏甭綳繃绷菶蹦迸鏰镚閍鞛佊佖俾偪匕吡哔嗶坒堛壁夶奰妣妼婢嬖屄币幣幤庇庳廦弊弻弼彃彼必怭愊愎敝斃朼柀梐楅榌比毕毖毙毴沘湢滗滭潷濞煏熚狴獘獙珌璧畀畁畢疕疪痹皕碧秕笔筆筚箅篦篳粊綼縪繴纰罼聛肶腷臂舭芘苾荜荸萆萞蓖蓽蔽薜蜌袐裨襅襞襣觱詖诐貏貱賁贔赑跸蹕躃躄逼避鄙鄨鄪鏎鐴铋閇閉閟闭陛鞁鞞韠飶饆馝駜驆髀魓鮅鰏鲾鵖鷝鷩鸊鼊鼻便匾卞变変峅弁徧忭惼扁抃揙昪汳汴炞煸玣疺砭碥稨窆笾箯籩糄編缏编艑苄萹藊蝙褊覍變豍贬辡辧辨辩辫辮边辺遍邉邊邲釆鍽閞鞕鞭鯾鯿鳊鴘俵儦墂婊嫑幖彪摽杓标標檦滮瀌熛爂猋瘭磦脿膘臕表裱褾覅諘贆鋲錶鏢鑣镖镳颷飆飇飈飊飑飙飚骉骠鰾鳔別别咇彆徶憋柭柲瘪癟莂虌蛂蟞襒蹩鱉鳖鼈龞傧儐宾彬摈擯斌梹椕槟殡殯汃滨濒濱濵瀕玢瑸繽缤膑臏虨訜豳賓賔邠鑌镔霦顮髌髕髩鬂鬓鬢丙並仌仒併倂偋傡兵冫冰垪寎并幷怲抦掤摒昞昺柄栤棅檳氷炳病禀秉窉竝絣苪蛃誁邴鈵陃靐鞆鞸餅餠饼鮩亳仢伯侼僠僰剝剥勃博啵嚗妭孹嶓帛愽懪拨挬搏播擘桲檗欂泊波浡渤溊煿牔犦狛玻瓝瓟癶癷盋礡礴秡箔簙簸糪紴缽胉脖膊舶艊菠萡葧蔔蘗袯袰襮詙譒跛踣蹳郣鈸鉑鉢鋍鎛鑮钵钹铂镈餑餺饽馎馛駁駮驋驳鮁鮊鱍鲌鵓鹁\ue84b不佈勏卜卟吥咘哺埗埠峬巭布庯廍怖悑抪捕撲晡步歨歩瓿篰簿荹蔀补補誧踄轐逋部醭鈈鈽钚钸餔餢鳪鵏鸔嚓囃擦攃礤礸遪乲倸啋埰婇寀彩才採材棌毝猜睬綵縩纔菜蔡裁財财跴踩采䅟傪儏参參嬠惨惭慘慙慚憯残殘湌澯灿燦爘璨粲薒蚕蝅蠶蠺飡餐驂骖黪黲\ue835⺋仓仺伧凔嵢沧滄濸獊篬舱艙苍蒼藏螥賶鑶嘈嶆愺慒懆撡操曹曺槽漕糙肏艚艸艹草蓸螬褿襙鏪騲鼜侧側冊册厕墄夨恻惻憡敇测測策筞箣荝萗萴蓛叅岑嵾梣涔硶乽噌层層岾曾猠竲蹭驓仛侘偛叉嗏垞奼姹察岔嵖差挿插揷搽摖杈查査槎檫汊碴紁肞臿艖芆茬茶衩诧釵銟鍤鑔锸镲靫侪儕喍囆扠拆柴犲疀瘥祡虿蠆袃訍豺钗丳产佔儳冁刬剗剷劖啴嚵囅壥婵嬋孱巉幝幨廛忏懴懺掺搀摲摻旵梴棎毚浐湹滻潹潺澶瀍瀺灛煘獑產産硟磛禅簅緾繟纏纒缠羼艬蒇蕆蝉蟾裧觇誗諂讇讒谄谗躔辿鄽酁鋋鋓鏟鑱铲镵閳闡阐韂颤饞馋骣仩伥倡偿僘償兏厂厰唱嘗嚐场場塲娼嫦尝常廠徜怅悵惝敞昌昶晿暢椙氅淐猖琩瑺瓺甞畅畼肠腸膓苌菖萇蟐裮誯鋹錩鏛锠长阊韔鬯鯧鱨鲳鲿鼚仦劋吵嘲巐巢巣弨怊抄晁朝欩漅潮炒煼牊眧窲罺耖觘謿超轈鄛鈔钞麨偖勶唓坼屮彻徹扯掣撤撦澈烢爡瞮砗硨硩聅莗蛼車车迠頙偁傖嗔嚫塵墋夦宸尘忱抻敐晨曟栕榇樄沉煁琛疢瘎瞋碜磣臣茞莐蔯薼螴衬襯訦諃諶讖谌谶賝贂趁趂趻踸辰郴醦陈陳霃鷐麎齓齔龀丞乗乘倀凈呈城埕堘塍塖宬峸庱悜惩憆懲成承挰掁揨摚撐撑朾枨柽棖棦橕橙檉檙氶泟洆浾溗澄瀓爯牚珵珹琤瑲畻睈瞠碀秤称程稱穪窚竀筬絾緽罉脭荿蛏蟶裎誠诚赪赬逞郕酲鋮鏳鏿鐣铖阷靗頳饓騁騬骋鯎伬侈侙傺勅卶叱叺吃呎哧啻嗤垑墀妛媸尺岻弛彨彲彳恜恥慗憏懘扡抶持摛摴攡敕斥杘歯殦池湁灻炽烾熾瓻痓痴痸瘛癡眵瞝竾笞筂篪翄翅翤翨耻肔胣腟茌蚇蚩蚳螭裭褫訵謘豉貾赤趐趩踟迟遅遟遫遲鉓鉹雴饬馳驰魑鴟鵄鶒鷘鸱麶黐齒齝齿充冲喠嘃宠寵崇崈忡憃憧揰摏沖浺珫罿翀舂艟茺虫蟲衝褈蹖銃铳隀䌷丑丒仇侴俦吜嬦惆愁懤抽杻杽栦殠燽犨犫畴疇瘳皗瞅矁稠筹篘紬絒绸臭菗讎讐诪踌躊遚酧酬醜雔雠魗鮘\ue837亍俶傗储儊儲処出刍初厨处岀幮廚怵慉憷搐斶杵椘楚楮榋樗橱橻檚櫉櫥歜滁濋炪犓珿琡璴畜矗础礎禇竌竐篨絀绌耡臅蒢蒭處蜍蟵褚触觸詘豖豠貙趎蹰躇躕鄐锄閦除雏鶵黜齣齭齼䦟䦷揣搋欼膗膪踹\ue850\ue852串传傳剶喘巛川暷椽歂氚汌猭玔瑏穿舛舡船荈賗輲遄釧钏倉傸刅创刱剏剙創噇床怆愴摐牀牎牕疮瘡磢窓窗窻闖闯倕吹圌垂埀捶搥桘棰槌炊硾菙錘鎚锤陲顀龡䲠偆僢唇堾媋惷旾春暙杶椿槆橁櫄浱淳滣漘犉瑃睶箺純纯脣莼萅萶蒓蝽蠢賰踳醇醕陙鯙鰆鶞鹑\ue858啜嚽惙戳拺擉歠涰磭綽繛绰趠踔輟辍逴酫鑡齪龊伺佌佽偨刺刾厠呲垐嬨庛廁慈朿柌栨次此泚濨玆玼珁瓷甆疵皉磁礠祠粢糍絘茈茦茨莿蛓螆詞词賜赐趀跐辝辞辤辭雌飺餈鴜鶿鷀鹚丛从匆叢囪囱婃孮従徖從忩怱悤悰暰枞樬樷欉淙漗灇焧爜琮瑽璁瞛篵繱聡聦聪聰苁茐葱蔥藂蟌誴謥賨賩鏦騘驄骢凑楱湊腠輳辏促卆娕娖媨徂憱殂猝瘄瘯簇粗縬蔟觕誎趗踀蹙蹴蹵醋顣麁麄麤鼀巑撺攅攛攢櫕殩汆熶爨窜竄篡簒菆蹿躥鑹镩乼催凗啐啛墔崔忰悴慛摧榱毳淬漼焠璀疩瘁皠磪竁粋粹紣翆翠脃脆膬膵臎萃鏙侟刌存寸忖村洊澊皴竴籿膥邨剉剒厝夎嵯嵳挫措搓撮瑳痤矬磋縒脞莝莡蒫蓌蔖虘襊蹉逪遳醝銼錯锉错髊鹺鹾齹亣匒呾咑哒嗒噠垯墶大妲怛打搭撘汏溚炟燵畣瘩眔笪答繨羍耷荅荙薘蟽褡詚跶躂达迏迖迚達鐽靼鞑龖龘代侢傣叇呆呔垈埭岱帒带帯帶待怠懛戴曃柋歹殆瀻獃玳瑇甙簤紿緿绐艜蔕袋襶貸贷軑軩轪迨逮霴靆鴏黛黱丹亶亻但僤儋刐勯匰单単啖啗啿單噉嚪妉媅帎弾彈惮愖憚憺抌担掸擔旦柦殚殫氮沊泹淡澹燀狚玬瓭甔疍疸瘅癉癚眈砃禫窞箪簞紞繵耼耽聃聸胆腅膽萏蓞蛋蜑衴褝襌襜覘觛誕譂诞贉躭郸霮饏馾駳髧鴠黕儅党凼噹圵垱壋宕当挡擋档檔氹澢珰璗璫瓽當盪瞊砀碭礑筜簹艡荡菪蕩蟷裆襠譡讜谠趤鐺铛雼黨倒儔刀到叨噵壔导導岛島嶋嶌嶹帱幬忉悼捣捯搗擣梼椡槝檤檮氘瓙盗盜祷禂禱稲稻箌纛翿舠艔菿衜衟裯蹈軇道釖陦隝隯魛鱽嘚得徳德恴悳惪棏淂的脦鍀锝扥扽僜凳噔墱嬁嶝戥櫈澂灯燈璒登瞪磴竳等簦艠覴豋蹬邓鄧鐙镫隥仾低俤偙僀厎呧哋唙啇啲嘀嚁嚸地坘坻埊埞堤墑墬娣嫡嶳帝底廸弚弟弤彽怟慸抵掋敌敵旳柢梊梑棣楴樀氐泜涤滌滴焍牴狄玓甋眱睇砥碲磾祶禘笛第籴糴締缔羝肑腣苖荻菂菧蒂蔋蔐藡蝃螮袛觌诋谛豴赿趆踧踶軧迪递逓邸釱鉪鍉鏑镝阺隄靮鞮頔馰骶鯳鸐嗲丶佃傎典厧坫垫壂奌奠婝婰嵮巅巓巔店惦扂掂攧敁敟椣橂殿淀滇澱点玷琔电甸瘨癜癫癲碘磹簟蒧蕇蜔踮蹎電靛頕顛颠驔點齻伄凋刁刟叼吊奝嬥屌弔弴彫扚掉椆汈琱瘹碉窎窵竨簓絩蓧藋虭蛁訋調貂釣鈟銱鋽鑃钓铞雕雿魡鮉鯛鲷鵰鼦叠咥喋垤堞峌嵽幉恎戜曡曢殜氎爹牃牒瓞畳疂疉疊眣碟絰绖耊耋胅艓苵蜨蝶褋褺詄谍跌跮蹀蹛迭镻鲽丁亇仃叮啶奵定嵿帄忊掟椗玎町甼疔盯矴碇碠磸耵腚艼萣薡虰蝊訂订酊釘錠鐤钉锭靪頂顁顶飣饤鼎丟丢銩铥颩东侗倲働冬冻凍动動咚垌埬墥夂姛娻嬞岽峒崠崬徚恫懂戙挏昸東栋棟氡氭洞涷湩硐笗箽胨胴腖苳菄董蕫蝀諌迵霘駧鮗鯟鶇鶫鸫鼕乧兜兠剅吋唗唞抖斗斣梪橷浢痘瞗窦篼脰荳蔸蚪豆逗郖都酘閗闘阧陡餖饾鬥鬦鬪鬬鬭凟匵厾叾嘟堵妒妬嬻度杜椟櫝殬殰毒涜渎渡瀆牍牘犊犢独獨琽瓄皾督睹秺竇笃篤肚芏荰蝳螙蠧蠹裻覩詫読讀讟读豄賭贕赌醏錖鍍鑟镀阇靯韇韣韥騳髑黩黷偳塅媏断斷椴段毈煅瑖短碫端篅簖籪緞縀缎腶葮躖鍛鍴锻兌兑垖堆塠对対對嵟怼憝懟濧瀩痽碓磓祋綐薱譈譵錞鐜镦队陮隊頧鴭伅吨噸墩墪墫壿惇憞撉撴敦沌潡炖燉犜獤盹盾砘碷礅趸踲蹲蹾躉逇遁遯鈍鐓钝頓顿驐亸凙刴剁剟剫咄哆哚嚉嚲垛垜埵堕墮墯多夛夺奪奲尮崜惰憜挅挆掇敓敚朵朶杕枤桗椯毲沲痥綞缍舵茤裰趓跢跥跺踱躱躲鄲鈬鐸铎陊隳飿饳鬌鮵鵽俄偔僫匎卾厄吪呃呝咢噁噩囮垩堨堮妸妿娥娾娿婀屙屵峉峨峩崿廅恶悪惡愕戹扼搹擜旕枙櫮欕歞歺洝涐湂珴琧皒睋砈砐砨砵硆磀腭苊莪萼蕚蚅蛾蝁覨訛誐諤譌讍讹谔豟軛軶轭迗遌遏遻鄂鈋鈪鍔鑩锇锷阏阨阸頋頞頟額顎颚额餓餩饿騀鰐鱷鳄鵈鵝鵞鶚鹅鹗齶欸诶嗯奀峎恩摁煾蒽鞥乻二佴侕儿児兒刵咡唲尒尓尔峏弍弐栭栮毦洏洱爾珥粫而耳胹荋薾衈袻誀貮貳贰趰輀轜迩邇鉺铒陑隭餌饵駬髵鮞鲕鴯鸸乏伐佱傠发垡墢姂廢彂撥栰沷法灋珐琺発發瞂砝笩筏罚罰罸藅貶醗鍅閥阀髪髮⺁仮凡凢凣勫匥反噃墦奿嬎嬏帆幡忛憣攵旙旛杋柉桳梵棥樊橎氾汎泛滼瀪瀿烦煩燔犯璠畈番盕矾礬笲笵範籵緐繁繙羳翻舤舧舩范蕃薠藩蘩蠜襎訉販贩蹯軬輽轓返釩鐇钒颿飜飯飰饭鱕鷭仿倣匚坊埅堏妨房放方旊昉昘枋淓牥瓬眆眪祊紡纺肪舫芳蚄訪访邡鈁錺钫防髣魴鲂鴋鶭⺄俷剕匪厞吠啡奜妃婓婔屝废廃悱扉斐昲暃曊杮棐榧橃櫠沸淝渄濷犻狒猆疿痱癈篚緋绯翡肥肺胇腓芾菲萉蕜蕟蜚蜰蟦裶襏誹诽費费鐨镄陫霏靅非靟飛飝飞餥馡騑騛鯡鲱鼣鼥份偾僨兝分吩坆坋坟墳奋奮妢岎帉幩弅忿愤憤昐朆朌枌梤棻棼橨氛汾瀵炃焚燌燓獖瞓秎竕粉粪糞紛纷羒羵翂肦膹芬蒶蕡蚠蚡豮豶躮轒酚鈖鐼隫雰頒餴饙馚馩魵鱝鲼鳻黂黺鼖鼢丰仹俸偑僼冯凤凨凬凮唪埄堸奉妦寷封峯峰崶枫桻楓檒沣沨渢湗灃烽焨煈犎猦琒瓰甮疯瘋盽砜碸篈綘縫缝艂葑蜂蠭覂諷讽豊豐賵赗逢鄷酆鋒鎽鏠锋靊風飌风馮鳯鳳鴌麷仏仸佛坲否殕紑缶缹缻雬鴀乀付伏伕俌俘俯偩傅冨冹凫刜副匐呋呒咈咐哹坿垘報复夫妇姇娐婏婦媍嬔孚孵富尃岪巿帗幅幞府弗弣彿復怤怫懯払扶抚拂拊捬敷斧旉服枎柎柫栿桴椨椱榑氟泭洑浮涪滏澓炥烰焤父玞玸琈甫甶畉畐畗癁盙砆砩祓祔福禣秿稃稪竎符笰筟箁箙簠粰糐紨紱紼絥綍綒緮縛绂绋缚罘罦翇肤胕腐腑腹艀艴芙芣苻茀茯荂荴莩菔萯葍蕧虙蚥蚨蚹蛗蜉蝜蝠蝮衭袚袝袱複褔覄覆訃詂諨讣豧負賦賻负赋赙赴趺跗踾輔輹輻辅辐邚邞郙郛酜釜釡鈇鉘鉜鍑鍢阜阝附韍韛韨颫颰馥駙驸髴鮄鮒鮲鰒鲋鳆鳧鳬鴔鵩鶝麩麬麱麸黻黼伽嘎嘠噶夾尕尜尬旮玍錷钆魀丐乢匃匄垓姟峐忋戤摡改晐概槩槪溉漑瓂畡盖祴絠荄葢該该豥賅賌赅鈣鎅钙陔隑乹亁倝凎凲咁坩尲尴尶尷干幹感扞擀敢旰杆柑榦橄檊泔淦漧澉澸灨玕玵甘疳皯盰矸秆稈竿笴筸簳粓紺绀肝芉苷衦詌贛赣赶趕迀酐釬骭魐鱤鳡㧏㭎冈冮刚剛堈堽岗岡崗戆掆杠棡槓港焵焹牨犅疘筻綱纲缸罁罡肛釭鋼鎠钢\ue827\ue82d勂吿告夰峼搞杲槁槔槹橰檺櫜皋睪睾祮祰禞稁稿筶篙糕縞缟羔膏臯菒藁藳誥诰郜鋯锆镐韟餻高髙鷎鷱鼛个仡佮個割匌各呄哥嗝嗰圪塥彁愅戈戓戨搁搿擱敋杚格槅櫊歌滆滒疙硌箇胳膈臵舸葛蓋虼袼觡諽謌轕鎶铬镉閣閤阁隔革鞷韐韚騔骼鮯鰪鴚鴿鸽給给亘哏揯搄根艮茛跟亙刯哽埂堩峺庚挭更梗椩浭焿畊絚綆緪縆绠羮羹耕耿莄菮賡赓郠骾鯁鲠鶊鹒⺗供兣公共功匑匔唝塨宫宮工巩幊廾弓恭慐拱拲攻杛栱汞熕珙碽篢糼肱蚣觥觵貢贑贡躬躳輁鞏髸龏龔龚佝冓勾坸垢够夠姤媾岣彀搆撀构枸沟溝煹狗玽笱篝簼緱缑耇耈耉芶苟袧褠覯觏訽诟豿購购遘鈎鉤钩雊鞲韝估傦僱凅古咕唂唃啒固堌夃姑嫴孤尳崓崮愲扢抇故柧梏棝榖榾橭毂汩沽泒濲瀔牯牿痼皷皼盬瞽祻稒笟箍箛篐糓罛罟羖股脵臌菇菰蓇薣蛄蛊蛌蠱觚詁诂谷軱軲轂轱辜逧酤鈷錮钴锢雇顧顾餶馉骨鮕鯝鲴鴣鸪鹘鼓鼔冎刮剐剮劀卦叧呱啩坬寡挂掛歄焻煱瓜罣胍苽褂詿诖銽颪騧鴰鸹乖叏夬怪恠拐掴枴柺箉罫倌关冠官悹悺惯慣掼摜棺樌欟毌泴涫灌爟琯瓘痯瘝癏盥礶祼窤筦管罆罐舘莞萖蒄覌観觀观貫贯躀輨遦錧鏆鑵関關館馆鰥鱞鱹鳏鳤鹳⺌侊俇僙光咣垙姯广広廣桄櫎洸灮炗炚炛烡犷珖胱茪輄迋逛銧黆亀佹刽刿劊劌匦匭厬圭垝妫媯嬀宄帰庋庪廆归摫撌攰攱晷柜桂桧椝椢槶槻槼櫃櫷歸湀猤珪瑰璝瓌癸皈瞡硅祪禬竃筀簋茥蓕蛫蟡袿規规觤詭诡貴贵赽跪軌軓轨邽郌閨闺陒鬶鬼鱥鲑鳜鳺龜龟惃棍滚滾璭睴磙绲蓘蔉衮袞謴輥辊鮌鯀鲧啯嘓囗囯囶囻国圀國埚墎崞帼幗惈慖摑果椁槨淉漍濄猓瘑簂粿綶聒聝菓蔮虢蜾蝈裹褁过過郭鈛鍋鐹锅餜馃馘哈噺奤妎溌紦蛤蝦鈨鉿鎺铪鰰乤亥侅嗐嗨嚡塰孩害拸氦海烸絯胲还還郂酼醢餀饚駭駴骇骸⺳㘎㘚仠佄傼函凾含哻唅喊圅垾娢寒屽崡嵅忓悍憨憾捍撖撼攼旱晗晘暵桿梒汉汗汵浛浫涆涵漢澏瀚焊焓爳猂琀甝皔睅笒筨罕翰肣莟菡蔊虷蚶蛿蜬蜭螒谽豃邗邯酣銲鋎鋡閈闬雗韓韩頇頜頷顄顸颔馠馯駻鬫魽鳱鶾鼾\ue820\ue821垳夯忼斻杭沆笐筕絎绗航苀蚢貥頏颃魧傐儫号呺哠嗥嘷噑嚆嚎壕好恏昊昦晧暠暤暭曍椃毜毫浩淏滜澔濠灏灝獆獋獔皓皜皞皡皥秏竓籇耗聕蒿薃薅號蚝蠔譹豪郝鄗鎬顥颢鰝何佫劾合呙呵咊和哬啝喛喝嗬嚇垎壑姀寉峆惒抲挌曷柇核楁河涸渮澕煂熆爀犵癋皬盇盉盍盒碋禾秴篕籺粭紇纥翮翯荷菏萂蠚褐覈訶訸詥诃貉賀贺赫郃釛鉌鑉閡闔阂阖靍靎靏颌餲饸魺鲄鶴鸖鹖鹤麧齃齕龁龢嘿潶黑黒佷噷很恨拫狠痕詪鞎乥亨哼啈堼姮恆恒悙撗桁横橫涥烆珩胻脝蘅衡鑅鴴鵆鸻仜厷叿吰呍哄嗊嚝垬妅娂宏宖弘彋愩撔晎汯泓洪浤浲渱溄潂澒灴烘焢玒玜硔硡竑竤篊粠紅紘紭綋红纮羾翃翝耾苰荭葒葓蕻薨虹訇訌讧谹谼軣輷轟轰鈜鉷銾鋐鍧閎闳霐霟鞃魟鴻鸿黉黌侯候厚后吼呴喉垕堠帿後洉犼猴瘊睺矦篌糇翭腄茩葔詬豞逅郈鄇鍭餱骺鮜鯸鱟鲎鲘齁乊乎乕互俿冱冴匢匫呼唬唿喖嗀嗃嘑嘝囫垀壶壷壺婟媩嫭嫮寣岵帍弖弧忽怘怙惚戯戶户戸戽扈护摢擭斛昈昒曶枑楜槲槴歑沍沪泘浒淈淲淴湖滬滸滹瀫烀焀煳熩狐猢琥瑚瓠瓳祜笏箎箶簄粐糊絗綔縎縠胡苸萀葫蔛蔰虍虎虖虝蝴螜衚觳護豰軤轷鄠醐錿鍙鍸雐雽韄頀頶餬鬍魱鯱鰗鱯鳠鳸鴩鵠鶘鶦鶮鶻鸌鹄鹕鹱划劃化华哗嘩埖夻婲婳嫿嬅崋搳摦撶杹枠桦椛槬樺滑澅猾画畫畵砉硴糀繣花芲華蕐蘤螖話誮諙諣譁话輠錵鏵铧驊骅魤鷨黊坏壊壞徊怀懐懷槐櫰淮耲蘹蘾褢褱踝唤喚嚾圜奂奐嬛宦寏寰峘嵈幻患愌懽换換擐攌桓梙槵欢歓歡洹浣涣渙漶潅澣烉焕煥犿獾环瑍環痪瘓睆睔糫絙緩繯缓缳羦肒荁萈萑藧讙豢豩豲貆貛轘逭郇鍰锾闤阛雈雚驩鬟鯇鯶鰀鲩鴅鸛鹮偟兤凰喤堭塃墴奛媓宺崲巟幌徨怳恍惶愰慌晃晄曂楻榥汻湟滉潢炾煌熿獚瑝璜癀皇皝皩磺穔篁簧縨肓艎荒葟蝗蟥衁詤諻謊谎趪遑鍠鎤鐄锽隍餭騜鰉鱑鳇鷬黃黄㱮会佪僡匯卉咴喙嘒噅噕嚖囘回囬圚婎媈嬒寭屶屷幑廻廽彗彙彚徻徽恚恛恢恵悔惠慧憓懳拻挥晖晦暉暳會楎槥橞檅檓檜櫘毀毁毇汇泋洃洄浍滙潓瀈灰灳烠烣烩烪燬燴獩珲璤痐睳瞺硘禈秽穢篲絵繢繪绘缋翙翚翬翽芔茴荟蔧蕙薈薉藱蘳虺蛔蛕蜖螝蟪襘詯詼誨諱譓譭譮譿讳诙诲豗賄贿輝辉迴逥鐬闠阓隓靧鞼顪颒餯鮰鰴麾俒倱圂堚婚忶慁掍揮昏昬梡棔浑涽混渾溷濊焝琿睧睯緄荤蔒觨諢诨閽阍馄魂鼲伙佸俰剨劐吙咟喐嚯嚿夥奯姡惑或捇攉旤曤楇檴沎活湱漷濩瀖火灬焃獲癨眓矐祸禍穫耠耯腘膕臛获萿藿蠖謋豁貨货趏邩鈥鍃鑊钬锪镬霍騞丌丮乩亟亼亽伋伎佶偈偮僟兾冀几击刉刏剂剞剤劑勣卙即卽及叝叽吉咭唧喞嗘嘰圾坖垍基堲塉墼妀妓姞姬嫉季寂寄屐岋岌峜嵆嵇嵴嶯己幾庴廭彐彑彶徛忌忣急悸惎愱懻戟戢技挤掎揤撃撠擊擠旡既旣暨暩曁机极枅梞棘楫極槉槣樭機橶檕檝檵櫅殛毄汲泲洎济済湒漃漈潗激濟瀱犄犱玑璣畟畸畿疾痵瘠癠癪皀皍矶硛磯祭禝禨积稩稷稽穄穊積穖笄笈筓箕箿簊簎籍糭紀級継績繫繼级纪继绩缉罽羁羇羈耭肌脊脨膌臮艥艻芨芰茍荠萕葪蒺蓟蕀蕺薊薺蘎蘮蘻虀虮螏蟣蠀裚襀襋覉覊覬覿觊觙計記誋諅諔譏譤计讥记谻賫賷赍跡跻跽蹐蹟躋躸輯轚辑迹郆銈銡錤鍓鏶鑇鑙际際隮集雞雦雧霁霵霽鞿韲颳飢饑饥驥骥髻魢魥鮆鯚鯽鰶鰿鱀鱭鱾鲚鲫鳮鵋鶏鶺鷄鷑鸄鸡鹡麂齌齎齏齑价佳假傢加叚哿嘉嘏圿夹婽嫁宊家岬幏徍恝戛戞扴抸擖斚斝架枷梜椵榎榢槚檟毠泇浃犌猳玾珈甲痂稼笳筴糘耞胛腵荚莢葭蛱蛺袈袷裌豭貑賈贾跏迦郏郟鉀鉫鋏鎵钾铗镓頬頰颊餄駕驾鴐鴶鵊麚件俭俴倹健僣僭儉兼冿减剑剣剪剱劍劎劒劔囏坚堅墹奸姦姧寋尖幵建弿彅徤惤戋戔戩戬拣挸捡揀揃搛撿擶旔朁枧柬梘检検椷椾楗樫橺檢歼殱殲毽涧淺渐減湔湕溅漸澗濺瀐瀸瀽煎熞熸牋牮猏珔瑊瑐监監睑睷瞼硷碱磵礀礆礛笕笺筧简箋箭篯簡籛糋絸緘縑繝繭缄缣翦肩腱臶舰艦艰艱茧荐菅菺葌蒹蕑蕳薦藆虃螹蠒裥襇襉襔襺覵覸见詃諓諫謇謭譼譾谏谫豜豣賎賤贱趝趼跈践踐踺蹇轞釼鉴鋻鍳鍵鎆鐗鐧鑑鑒鑬鑳锏键閒間间鞬鞯韀韉餞饯馢鬋鰎鰔鰹鲣鵳鹣鹸鹻鹼麉傋僵勥匞匠壃奖奨奬姜将將嵹弜弶彊摾杢桨槳橿櫤殭江洚浆滰漿犟獎畕畺疅疆礓糡糨絳繮绛缰翞耩膙茳葁蒋蔣薑螀螿袶講謽讲豇酱醤醬降韁顜鱂鳉䴔交佼侥僬儌剿勦叫呌嘂嘄嘐嘦噍噭嚼姣娇嬌嬓孂峧嶕嶣徼悎憍憿挍挢搅摷撟撹攪敎教敫敽敿斠晈暞曒椒樔櫵浇滘漖澆灚焦煍燋燞狡獥珓璬皎皦皭矫矯礁穚窖笅筊簥糹絞繳纐绞缴胶脚膠膲臫艽芁茭蕉藠虠蛟蟭角訆譑譥賋趫趭跤踋較轎轿较郊酵醮釂鉸鐎铰餃饺驕骄鮫鱎鲛鵤鷦鷮鹪\ue85d丯介借偼傑兯刦刧刼劫劼卩卪吤哜啑喈喼嗟嚌堦堺姐婕媎媘媫孑尐屆届岊岕崨嵥嶻巀幯庎徣忦戒截拮捷接掲掶揭擑擮斺昅杰桀桝楐楶榤構檞櫭毑洁滐潔煯犗狤玠琾界畍疖疥痎癤皆睫砎碣礍秸稭竭節紒結絜结羯耤脻节芥莭蓵藉蚧蛶蜐蝍蝔蠘蠞蠽街衱衸袺裓褯解觧訐詰誡誱讦诘诫趌跲踕迼鉣鍻阶階鞂鞊颉飷骱魝魪鮚鲒鶛鶡仅今仐侭僅僸儘兓凚劲卺唫噤嚍堇堻壗妗嫤嬧寖尽巹巾惍慬搢斤斳晉晋枃榗槿殣津浕浸溍漌濜烬煡燼珒琎琻瑨瑾璡璶盡矜矝砛祲禁筋紟紧緊縉缙荩菫蓳藎衿襟覲觐觔謹谨賮贐赆近进進金釒錦鏱钅锦靳饉馑鹶黅齽䴖丼井京亰傹儆儬兢净刭剄劤勁坓坕境妌婙婛婧宑幜弪弳径徑惊憬憼敬旌旍景晶暻曔桱梷橸汫汬泾浄涇淨澋瀞燝猄獍獷璄璟璥痉痙睛秔稉穽竞竟竫競竸粳精経經经聙肼胫脛腈茎荆荊莖菁葏蟼誩警踁迳逕鏡镜阱靖静靜頚頸颈驚鯨鲸鵛鶁麖麠鼱\ue85f侰僒冂冋冏囧埛扃昋浻澃炅炯烱煚煛熲燑燛窘絅綗臦臩蘏蘔褧迥逈颎駉駫丩久乆九乣倃僦勼匓匛匶厩咎啾奺就廄廏廐慦揪揫摎救旧朻杦柩柾桕欍殧氿汣湬灸玖畂疚究糺糾紤纠臼舅舊舏萛赳酒镹阄韭韮鬏鬮鯦鳩鷲鸠鹫麔齨䴗举伡侷俥俱倨倶具凥剧劇勮匊句咀啹埧埾壉姖娵婅婮局居屦屨岠崌巈巨怇惧愳懅懼抅拒拘拠挙挶捄据掬據擧昛柤桔梮椇椈椐榉榘橘檋櫸欅歫毩毱沮泃泦洰涺淗湨澽炬烥焗焣犋犑狊狙琚疽痀矩秬筥簴粔粷罝耟聚聥腒舉艍苣苴莒菊蒟蘜虡蚷蜛袓裾襷詎諊讵豦趜距跼踘踞踽蹫躆躹輂遽邭郹醵鉅鉏鋤鋦鋸钜锔锯閰陱雎雛鞠鞫颶飓駏駒駶驧驹鮔鴡鵙鵴鶋鶪齟龃\ue860倦劵勌勬卷呟埍奆姢娟巻帣惓慻捐捲桊涓淃狷瓹眷睊睠絭絹绢罥羂臇菤蠲裐讂鄄鋑錈鎸鐫锩镌闂餋鵍鵑鹃䦆亅倔傕决刔劂厥吷噘壆孒孓屩屫崛嶡嶥彏憠憰戄抉挗掘撅撧攫斍桷橛橜欮殌氒決灍焆熦爑爝爴爵獗玃玦玨珏瑴瘚矍矡砄絕絶繘绝腳臄芵蕝蕨虳蟨蟩覐覚覺觉觖觼訣譎诀谲貜趉趹蹶蹷鈌鐝钁镢镼髉鱖鴂鴃鷢龣\ue84f俊儁军君呁均埈寯峻懏捃攈攟晙桾棞汮浚焌燇珺畯皲皸皹碅竣筠箟莙菌蔨蚐蜠袀覠軍郡鈞銁銞鋆鍕钧陖隽雋餕馂駿骏鮶鲪鵔鵕鵘麇佧卡咔咖哢喀垰嬶桛胩裃鉲鯑凯凱剀剴勓喫嘅噄垲塏奒嵦开忾恺愒愷慨揩暟楷欬濭炌烗蒈衉輆鍇鎎鎧鐦铠锎锴開闓闿颽乫侃偘冚凵刊勘坎堪堿塪墈崁惂戡栞槛檻欿看瞰矙砍磡竷莰衎輡轗闞阚龕龛亢伉匟囥嫝嵻康慷扛抗摃槺漮炕犺砊穅粇糠躿邟鈧鏮钪閌闶鱇丂尻拷攷栲槀洘烤犒稾考薧銬铐靠髛鮳鯌鲓克兙兛兞兡刻勀勊匼厼可咳嗑坷堁壳娔客岢峇嵑嵙嶱恪悈愙搕敤柯棵榼樖歁毼氪渇渴溘炣牁牱犐珂疴痾瞌碦磆磕礊礚科稞窠緙缂翗胢苛萪薖蚵蝌袔課课趷軻轲迲醘鈳錁钶锞頦顆颏颗騍骒髁剋尅啃垦墾恳懇掯肎肯肻裉褃錹乬劥吭唟坑奟妔巪怾牼硁硜硻誙銵鍞鏗铿阬倥埪孔崆廤恐悾控涳矼硿空箜躻錓鞚鵼冦剾劶口叩宼寇彄怐扣抠摳敂滱眍瞉瞘窛筘簆芤蔲蔻釦鷇俈刳哭喾嚳圐堀崫库庫捁搰朏枯桍楛焅狜瘔硞秙窟絝绔胐苦袴裤褲跍郀酷骷鮬侉咵垮夸姱恗挎絓胯舿誇趶跨銙骻㧟侩儈凷哙噲圦块塊巜廥快擓旝澮狯獪璯筷糩脍膾蒯郐鄶駃鱠鲙\ue828宽寛寬欵款歀窽窾鑧髋髖丱儣况劻匡匩卝哐圹壙夼岲恇懬懭抂旷昿曠框況洭爌狂狅眖眶矌矿砿硄礦穬筐筺絋絖纊纩誆誑诓诳貺贶軖軠軦軭邝邼鄺鉱鋛鑛鵟黋䙌䙡亏傀刲匮匱卼喟喹嘳夔奎媿嬇尯岿巋巙愦愧憒戣揆晆暌楏楑樻櫆欳殨溃潰煃盔睽瞆瞶窥窺篑簣籄聧聩聭聵胿腃膭葵蒉蒊蕢藈蘬蘷虁虧蝰謉跬蹞躨逵鄈鍨鍷鐀鑎闚頍頯顝餽饋馈馗騤骙魁\ue82e\ue841\ue842困坤堃堒壸壼婫尡崐崑悃捆昆晜梱涃潉焜熴猑琨瑻睏硱祵稇稛綑臗菎蜫裈裍裩褌豤貇醌錕锟閫閸阃餛騉髠髡髨鯤鲲鵾鶤鹍廓彉彍懖扩拡括挄擴栝桰濶秮秳穒筈葀蛞銛铦闊阔霩鞟鞹韕頢鬠剌啦喇嚹垃拉揦揧旯柆楋櫴溂瓎瘌砬磖翋腊臈臘菈藞蜡蝋蝲蠟辢辣邋鑞镴鞡鬎鯻來俫倈勑唻婡崃崍庲徕徠攋来梾棶涞淶濑瀨瀬猍琜癞癩睐睞筙箂籁籟莱萊藾襰誺賚賴赉赖逨郲錸铼頼顂騋鯠鵣鶆麳僋儖兰嚂囒坔壈婪嬾孄孏岚嵐幱懒懶拦揽擥攔攬斓斕暕栏榄欄欖欗浨滥漤澜濫瀾灆灠灡烂燗燣燷爁爛爤爦璼瓓礷篮籃籣糷繿纜缆罱葻蓝藍蘫蘭褴襕襤襴襽覧覽览譋讕谰躝醂鑭钄镧闌阑韊勆唥啷埌塱嫏崀廊斏朖朗朤桹榔樃欴浪烺狼琅瑯硠稂筤艆蒗蓈蓢螂誏躴郎郒郞鋃锒閬阆佬僗劳労勞咾哰唠嘮姥嫪崂嶗恅憥憦捞撈朥栳橯浶涝澇烙牢狫珯痨癆硓窂簩粩老耂耢耮荖蛯躼軂轑酪醪銠鐒铑铹顟髝鮱乐了仂勒叻忇楽樂氻泐牞玏砳竻簕阞韷餎饹鰳鳓傫儡厽嘞垒塁壘壨嫘擂攂樏檑櫐泪洡涙淚灅瓃畾瘣癗矋磊磥礌礧礨禷类累絫縲纇纍纝缧罍羸耒肋腂蔂蕌蕾藟蘱蘲蘽虆蠝誄讄诔轠酹銇鐳鑘鑸镭雷靁頛頪類颣鱩鸓鼺冷堎塄愣棱楞睖碐薐踜丽例俐俚俪傈儮儷凓刂刕利剓剺劙力励勵历厉厘厤厯厲叕吏呖哩唎唳喱嚟嚦囄囇坜塛壢娌娳婯嫠孋孷屴岦峛峲廲悝悡悧悷慄戾扐搮攊暦曆曞朸李枥柂栃栗栛梨梸棃樆檪櫔櫪欐欚歴歷沥浬涖溧漓澧濿瀝灕爏犁犂犡狸猁珕理琍瑮璃瓅瓈瓑瓥疠疬痢癘癧皪盠盭睝砅砺砾磿礪礰礼禮禲离秝穲立竰笠筣篥篱籬粒粚粝粴糎糲縭缡罹脷艃苈苙茘荔荲莅莉菞蒚蒞蓠蔾藜藶蘺蚸蛎蛠蜊蜧蟍蟸蠇蠡蠣蠫裏裡褵詈謧讈赲轢轣轹迣逦邌邐郦酈醨醴里鉝銐鋫鋰錅錑鎘鏫鑗锂隶隷隸離雳靂靋驪骊鬁鬲鬴鯉鯏鯬鱧鱱鱺鲡鲤鳢鳨鴗鵹鷅鸝鹂麗麜黁黎黧俩倆亷僆劆匲匳嗹噒堜奁奩媡嫾嬚帘廉怜恋慩憐戀摙敛斂梿楝槤櫣歛殓殮浰涟湅漣潋澰濂濓瀲炼煉琏瑓璉磏簾籢籨練縺纞练羷翴联聨聫聮聯脸臁臉莲萰蓮薕螊蠊裢裣褳襝覝謰蹥连連鄻錬鍊鎌鏈鐮链镰鬑鰊鰱鲢両两亮俍倞兩凉哴唡啢喨墚悢掚晾梁椋樑涼湸煷簗粮粱糧綡緉脼良莨蜋蜽裲諒谅踉輌輛輬辆辌量鍄靓靚駺魉魎僚嘹嫽寥寮尞尥屪嵺嶚嶛廖廫憀憭撂撩敹料暸樛橑潦炓燎爎爒獠璙疗療瞭窌窷竂簝繚缭聊膋膫蓼藔蟟蟧豂賿蹘蹽辽遼鄝釕鐐钌镣镽飉髎鷯鹩䴕儠冽列劣劽咧埒埓姴峢巁巤挒挘捩擸栵棙櫑毟洌浖烈烮煭爄爉犣猎猟獦獵睙綟聗茢蛚裂趔躐迾颲鬛鬣鮤鱲鴷\ue85e临亃僯冧凛凜吝啉壣崊嶙廩廪恡悋惏懍懔拎撛斴晽暽林橉檁檩淋潾澟瀶焛燐獜琳璘甐疄癛癝瞵碄磷稟箖粦粼綝繗翷膦臨菻蔺藺賃赁蹸躏躙躪轔轥辚遴邻鄰鏻閵阾隣霖顲驎鱗鳞麐麟〇令伶倰凌刢另呤囹坽夌姈婈孁岭岺崚嶺彾掕昤朎柃棂櫺欞泠淩澪瀮灵炩燯爧狑玲琌瓴皊砱祾秢稜竛笭紷綾绫羚翎聆舲苓菱蓤蔆蕶蘦蛉衑袊裬詅跉軨輘酃醽鈴錂铃閝陵零霊霗霛霝靈領领駖魿鯪鲮鴒鸰鹷麢齡齢龄龗六刘劉嚠塯媹嬼嵧廇懰旈旒柳栁桞桺榴橊橮沠流浏溜澑瀏熘熮珋琉瑠瑬璢瓼甅畄留畱疁瘤癅硫磂磟綹绺罶羀蒥蓅藰蟉裗蹓遛鋶鎏鎦鏐鐂锍镏镠陸雡霤飀飂飅飗餾馏駠駵騮驑骝鬸鰡鶹鷚鹠鹨麍咯囖儱咙嚨垄垅壟壠尨屸嶐巃巄徿拢攏昽曨朧栊梇槞櫳泷湰漋爖珑瓏癃眬矓砻礱礲窿竉笼篭籠聋聾胧茏蘢蠪蠬襱谾豅贚躘鏧鑨陇隆隴霳靇鸗龍龒龓龙䁖偻喽嘍塿娄婁寠屚嵝嶁廔搂摟楼樓溇漊漏熡甊瘘瘺瘻瞜窭窶篓簍耧耬艛蒌蝼螻謱貗遱鏤镂陋鞻髅髏\ue834侓僇剹勎勠卢卤嗠噜嚕嚧圥坴垆塶塷壚娽峍庐廘廬彔录戮挔捛掳摝撸擄擼枦栌椂樐樚橹櫓櫨氇氌泸淕淥渌滷漉潞澛瀂瀘炉熝爐獹玈琭璐璷瓐甪盝盧睩矑硉硵碌磠祿禄稑穋箓簏簬簵簶籙籚粶綠緑纑罏翏胪膔膚膟臚舮舻艣艪艫芦菉蓾蔍蕗蘆虂虏虜螰蠦觮觻謢賂赂趢路踛蹗輅轆轤轳辂辘逯鄜醁鈩錄録錴鏀鏕鏴鐪鑥鑪镥陆露顱颅馿騄騼髗魯魲鯥鱳鱸鲁鲈鴼鵦鵱鷺鸕鸬鹭鹵鹿麓黸乱乿亂卵圝圞奱娈孌孪孿峦巒挛攣曫栾欒滦灓灤癴癵羉脔脟臠虊釠銮鑾鵉鸞鸾圙掠擽略畧稤鋝鋢锊仑伦侖倫嗧囵圇埨婨崘崙惀抡掄棆沦淪溣碖磮稐綸纶耣腀菕蜦論论踚輪轮錀陯鯩倮儸儽剆啰囉寽峈摞攎攞攭曪椤欏欙泺洛洜漯犖猡玀珞瘰癳砢硦磱礫笿箩籮絡纙络罗羅脶腡臝茖荦萝落蓏蘿蛒螺蠃裸覶覼詻跞躒躶逻邏鉻鎯鏍鑼锣镙雒頱饠駱騾驘骆骡鮥鵅鸁侣侶僂儢勴吕呂哷垏屡屢履嵂律慮慺捋旅曥梠榈櫖櫚氯滤濾焒爈率祣稆穞穭箻絽縷繂绿缕膂膐膢葎蔞藘虑褛褸軁郘鋁鑢铝閭闾驢驴鷜傌吗唛嗎嘛妈媽嫲孖杩榪溤犘犸獁玛瑪痲痳睰码碼礣祃禡罵蔴蚂螞蟆蟇遤鎷閁馬駡马骂鬕鰢鷌麻买佅劢勱卖嘜嘪埋売脉荬蕒衇貍買賣迈邁霡霢霾鷶麥麦僈墁姏嫚屘幔慢慲摱曼樠満满漫澷熳獌瞒瞞矕縵缦蔄蔓蘰蛮螨蟎蠻謾谩鏋鏝镘顢颟饅馒鬗鬘鰻鳗厖吂哤壾娏忙恾朚杗杧氓汒浝漭牤牻痝盲盳硥硭笀芒茫莽莾蘉蛖蟒蠎邙釯鋩铓駹冃冇冒卯唜媢峁帽愗懋戼旄昴暓枆楙毛毷氂泖渵濹牦犛猫瑁皃瞀矛笷罞耄芼茂茅茆萺蓩蝐蟊袤覒貌貓貿贸軞鄚鄮酕鉚錨铆锚髦鶜么嚒嚰庅癦麼麽凂堳塺妹媄媒媚媺嬍寐嵄嵋徾抺挴攗昧枚栂梅楣楳槑殙毎每沒没沬浼渼湄湈煝煤燘猸玫珻瑂痗眉眊眛睂睸祙禖篃美羙脄脢腜苺莓葿蘪蝞袂跊躾郿酶鋂鎂鎇镁镅霉鬽魅鶥鹛黣黴们們悗悶惛懑懣扪捫暪椚滿焖燜璊菛虋鍆钔門閅门闷鞔儚冡勐夢夣孟幪庬懜懞懵掹擝曚朦梦橗檬氋溕濛猛獴甍甿盟瞢矇矒礞艋艨萌蒙蕄虻蜢蝱蠓鄳鄸錳锰霥霿靀顭饛髳鯍鯭鸏鹲黽鼆侎冪咪嘧塓孊宓宻密峚幂幎幦弥弭彌擟敉枈椧榓樒櫁汨沕泌洣淧渳滵漞濗瀰灖熐爢猕獼眯瞇祕祢秘穈米粎糜糸縻羃羋脒芈葞蒾蔝蔤藌蘼蜜袮覓覔覛觅詸謎謐谜谧迷醚醾醿釄銤镾靡鸍麊麋麛麿鼏丏俛偭免冕勉勔喕娩婂媔嬵愐杣棉檰櫋汅沔渑湎牑眄眠睌矈矊矏糆絻綿緜緬绵缅腼臱芇蝒面靣鮸麪麫麵麺仯厸喵妙媌嫹庙庿廟描杪淼渺眇瞄秒竗篎緢緲繆缈缪苗藐訬邈鱙鶓鹋乜吀咩哶孭幭懱搣旀櫗滅灭烕瓱篾簚蔑薎蠛衊鑖闑鱴鴓僶冺刡勄呡垊姄岷崏忞怋悯惽愍慜憫抿捪敃敏敯旻旼暋民泯湏湣潣珉琘琝瑉痻皿盿砇碈笢笽簢緍緡缗罠苠蠠鈱錉鍲閔閩闵闽鰵鳘黾佲冥凕名命姳嫇慏掵明暝朙榠洺溟猽眀眳瞑茗蓂螟覭詺鄍酩銘铭鳴鸣謬谬乮冐劘劰匁嗼嚜嚤圽塻墨妺嫫嫼嬤嬷寞尛帞怽懡戂抹摩摸摹撫擵攠昩末枺模橅歿殁沫漠瀎爅狢獏瘼皌眜眽眿瞐瞙砞磨礳秣糢絈纆耱脈膜茉莈莫蓦藦蘑蛨蟔袹謨謩谟貃貈貊貘銆鏌镆陌饃饝馍驀髍魔魩魹默黙侔劺厶哞堥恈某洠牟眸瞴蛑謀谋踎鉾鍪鴾麰亩仫凩募呣嘸坶墓姆娒峔幕幙慔慕拇暮暯木朷楘母毣毪氁沐炑牡牧牳狇畆畒畝畞畮目睦砪穆縸胟艒苜茻莯蚞踇鉧鉬钼雮霂鞪乸吶呐哪嗱妠娜拏拿捺搻秅笚笝納纳肭蒳衲袦豽貀軜那鈉鎿钠镎雫靹魶魸乃倷奈奶嬭孻廼柰氖渿疓耏耐腉艿萘褦迺釢錼鼐侽南喃囝囡娚婻嫨戁抩揇暔枏楠湳煵男畘腩莮萳蝻諵赧遖难難乪儾嚢囊囔擃攮曩欜灢饢馕鬞齉匘呶垴堖夒婥嫐孬峱嶩巎恼悩惱憹挠淖猱獿瑙硇碙碯脑脳腦蛲詉鐃铙閙闹鬧呢抐焾疒眲訥讷鼡內内娞氝氞痆腇餒馁鮾鯘媆嫩嫰恁腝竜能螚伱伲你倪儗儞匿坭埿堄妮妳婗嫟嬺孨尼屔屰怩惄愵懝抳拟掜擬旎昵晲暱柅檷氼沵泥淣溺濔狔猊眤睨禰秜籾縌聣聻胒腻膩臡苨薿蚭蜺觬誽貎跜迡逆郳鈮鉨銰鑈铌隬霓馜鯢鲵麑齯卄哖唸埝墊姩年廿念惗拈捻撚撵攆淰溓碾秊秥簐粘蔫躎輦辇鮎鯰鲇鲶鵇黏娘嬢孃酿醸釀嫋嬝嬲尦尿樢脲茑茮蔦袅裊褭鳥鸟啮嗫噛嚙囁囓圼孼孽峊嵲嶭巕帇捏揑摰敜枿棿槷櫱涅湼篞籋糱糵聂聶臬臲苶蘖蠥讘踂踗踙蹑躡錜鎳鑷钀镊镍陧隉顳颞齧囜您拰脌佞侫倿儜凝咛嚀嬣宁寍寕寗寜寧拧擰柠橣檸泞澝濘狞獰甯矃聍聹苧薴鑏鬡鸋⺧妞忸怓扭抝拗汼炄牛牜狃紐纽莥鈕钮靵侬儂农哝噥弄挊挵檂欁浓濃燶癑禯秾穠繷脓膿莀蕽襛農辳醲齈啂嬬槈檽獳羺耨譨譳鎒鐞伖伮傉努奴孥帑弩怒搙砮笯胬莻駑驽奻暖渜煖煗餪婩疟瘧硸虐傩儺喏嶿懦懧挪掿搦梛榒橠毭稬穤糑糥糯袲諾诺蹃逽郍鍩锘女恧朒沑籹聏衂衄釹钕乯哦噢嚄毮偶吘吽呕嘔怄慪櫙欧歐殴毆沤漚澫熰瓯甌筽耦腢膒蓲蕅藕藲謳讴鏂鴎鷗鸥齵䎬啪妑巼帊帕怕掱杷潖爬琶皅筢耙舥苩葩袙趴跁鈀俳哌徘拍排棑派渒湃牌犤猅箄簰簲蒎輫鎃丬冸判叛坢媻幋搫攀槃沜泮湴溿潘瀊炍爿牉畔畨盘盤盼眅眫碆磐磻縏膰萠蒰螌蟠袢褩襻詊跘蹒蹣鋬鎜鑻鞶頖鵥乓厐嗙夆嫎庞彷徬旁汸沗滂炐牓耪肨胖胮膖舽螃覫趽逄鎊雱霶髈鰟鳑龎龐刨匏咆喸垉奅庖抛拋泡炮炰爮狍疱皰砲礟礮穮脬萢藨袍褜跑軳鉋铇鞄颮麃麅麭伂佩俖呸培妚姵婄帔怌斾旆昢柸毰沛浿珮琣肧胚茷蓜衃裴裵賠赔轡辔配醅錇锫阫陪霈馷呠喷噴歕湓濆瓫盆翸葐衯伻倗傰剻匉嘭堋塜塳弸彭怦恲憉抨挷捀捧掽摓朋梈棚椖椪槰樥浌淎漨漰澎烹熢痭皏砰硼碰磞稝竼篣篷纄膨芃莑蓬蘕蟚蟛踫軯輣逬錋鑝閛闏韸韼駍騯髼鬅鬔鵬鹏䴙丕乶仳伓伾僻劈匹啤噼噽嚭圮坯埤壀媲嫓屁岯崥嶏庀怶悂憵批披抷揊擗旇朇枇椑毗毘毞淠澼炋焷狉狓猈琵甓疈疋疲痞痺癖皮睤睥砒磇礔礕禆秛秠稫笓箆篺粃紕罴羆翍耚脴脾腗膍苉蚍蚽蚾蜱螕螷蠯諀譬豼豾貔辟邳郫釽鈚鈲鈹鉟銔銢錃錍鎞铍闢阰陴隦霹駓髬魮魾鮍鲏鴄鷿鼙\ue862偏囨媥楄楩片犏猵獱璸甂篇緶翩胼腁覑諚諞谝貵賆跰蹁辯鍂駢騈騗騙骈骗骿鶣僄剽勡嘌嫖彯徱慓旚殍漂犥瓢皫瞟票篻縹缥翲蔈薸螵謤醥闝顠飃飄飘驃驫髟魒丿嫳撆撇暼氕潎瞥苤覕鐅品嚬姘娦嫔嬪拚拼朩榀汖牝玭琕矉砏礗穦聘薲蠙貧贫頻顰频颦馪驞乒俜凭凴呯坪塀娉屏屛岼帡帲幈平庰慿憑枰檘泙洴涄淜焩玶瓶甁甹砯硑竮箳簈缾聠胓艵苹荓萍蓱蘋蚲蛢評评軿輧郱鉼頩鮃鲆鵧䥽叵哱嘙嚩坡婆尀岥岶廹攴敀櫇泼洦淿湐潑濼烞猼珀皤破砶笸箥粕蒪蔢謈迫鄱酦醱釙鉕鏺钋钷頗颇馞駊髆髲魄兺剖咅哛垺娝抔抙捊掊犃裒襃郶頮仆僕匍噗圃圑圤埔墣巬扑捗擈普暜朴柨樸檏氆浦溥潽濮瀑炇烳獛璞痡瞨穙纀脯舖舗莆菐菩葡蒱蒲蜅襆襥諩譜谱贌蹼酺鋪鏷鐠铺镤镨陠鯆七乞亓企倛傶僛其凄剘启呇呚咠唘唭啓啔啟喰嘁噐器圻埼夡奇契妻娸婍屺岂岐岓崎嵜帺弃悽愭慼慽憇憩懠戚捿掑攲敧斉斊旂旗晵暣朞期杞柒栖桤桼梩棄棊棋棨棲榿槭檱櫀欫欹欺歧气気氣汔汽沏泣淇淒湆湇漆濝炁焏猉玂玘琦琪璂甈畦疧盀盵矵砌碁碕碛碶磜磧礘祁祈祺禥稘竒簯簱籏粸紪綥綦綨綮綺緀緕緝纃绮罊耆肐肵脐臍舙艩芑芞芪荎萁萋葺蕲藄蘄蚑蚚蛴蜝蜞螧蟿蠐袳褀褄觭訖諆諬讫豈起趞跂踑踖踦蹊躤躩軙軝迄迉邔郪鄿釮鏚鐖锜闙霋頎颀騎騏騹骐骑鬐鬾鬿魌魕鯕鰭鲯鳍鵸鶀鶈麒麡齊齐價冾圶峠帢恰愘拤掐揢楬殎洽矻硈葜跒酠鞐髂乾仟仱佥倩偂傔僉儙刋前千厱唊圱圲堑塹墘壍奷婜媊嬱孯岍岒嵌悓悭愆慊慳扦拑拪挳掮揵搴摼撁攐攑攓杄棈椠榩槏槧檶櫏欠歉歬汘汧浅潛潜濳灊熑燫牵牽犍皘竏签箝篏篟簽籖籤粁縴繾缱肷脥艌芊芡茜茾荕葥蒨蔳虔蚈蜸褰諐謙譴谦谴谸軡輤迁遣遷釺鈐鉗銭錢鏲鐱鑓鑯钎钤钱钳铅阡雃靬韆顅騚騝騫骞鬜鬝鰜鰬鳒鳽鵮鶼鹐黔黚呛唴嗆嗴墏墙墻嫱嬙嶈強强戕戗戧抢搶摤摪斨枪椌槍樯檣溬漒炝熗牄牆猐獇玱琷瓩繈繦羌羟羥羫羻腔艢蔃蔷薔蘠蜣襁謒跄蹌蹡鎗鏘鏹锖锵镪鶬鸧乔侨俏偢僑僺劁勪喬嘺墝墽嫶峤峭嵪嶠巧帩幧悄愀憔摮撬撽敲桥槗樵橇橋殻殼潐焳犞癄瞧硗硚磝磽礄礉窍竅繑翘翹荍荞蕎藮蟜誚譙诮谯趬跷踍蹺蹻躈郻鄡鄥釥鍫鍬鐈锹陗鞒鞘鞩鞽頝顦骹髚髜且倢切匧厒嗛妾怯悏惬愜挈朅栔椄洯淁疌癿穕窃竊笡箧篋籡緁聺苆茄藒蛣蛪詧趄踥郄鍥鐑锲鯜鰈亲侵儭勤厪吢吣唚嗪噙坅埁埐墐媇寑寝寢寴嵚嵰嶔嶜庈廑忴懃懄扲抋捦揿搇撳擒昑梫橬檎櫬欽沁溱澿濅瀙珡琴琹瘽禽秦笉耹芩芹菣菦菳藽蚙螓螼蠄衾覃親誛赾鈂鈙鈫鋟钦锓雂靲顉駸骎鮼鳹鵭䝼䞍倾傾凊剠勍卿啨圊夝寈庆庼廎情慶掅擎擏晴暒棾樈檠檾櫦殑殸氢氫氰淸清渹漀濪甠碃磬箐綪罄苘莔葝蜻請謦请軽輕轻郬錆鑋靑青靘頃顷鲭鶄黥\ue846\ue847䓖儝卭宆惸憌桏橩焪焭煢熍琼璚瓊睘瞏穷穹窮竆笻筇舼茕藑藭蛩蛬赹跫邛銎\ue840䲡丘丠俅厹叴唒囚坵塸媝崷巯巰恘扏搝朹梂楸殏毬求泅浗湫湭煪牫犰玌球璆皳盚秋秌穐篍糗紌絿緧肍莍萩蘒虬虯蚯蛷蝵蟗蠤裘觓觩訄訅賕赇趥逎逑遒邱酋醔釓釚釻銶鞦鞧頄鮂鯄鰌鰍鰽鳅鶖鹙鼽龝\ue859佉佢刞劬匤匷区區厺去取呿坥娶屈岖岨岴嶇弆忂怚憈戵抾敺斪曲朐朑欋欔欪氍浀淭渠灈煀爠璖璩癯瞿磲祛竘竬筁籧粬紶絇翵耝胊胠臞菃葋蕖蘧蚼蛆蛐螶蟝蠷蠼衐衢袪覰覷覻觑詓誳诎趋趍趣趨跔跙躣躯軀軥郥鐻鑺閴闃阒阹駆駈驅驱髷鮈鰸鱋鴝鶌鸜鸲麮麯麴麹黢鼁鼩齲龋佺全券劝勧勸啳圈圏埢奍姾婘孉峑巏弮恮悛拳搼权棬椦楾権權汱泉洤湶烇牶牷犈犬犭犮狋瑔畎痊矔硂筌箞絟綣縓绻荃葲虇蜷蠸觠詮诠跧踡輇辁酄醛銓鐉铨闎韏顴颧駩騡鬈鰁鳈齤却卻埆塙墧崅悫愨慤搉敠敪棤榷毃炔燩瘸皵确確碻礐礭缺缼蒛蚗闋闕阕阙隺雀鵲鹊囕囷夋宭峮帬歏箘羣群裙裠輑逡麏麕冄冉呥嘫姌媣染柟然熯燃珃繎肰苒蒅蚦蚺衻袇袡蹨髥髯嚷壌壤懹攘瀼爙獽瓤禳穣穰蘘蠰譲讓让躟鬤娆嬈扰擾桡橈犪繞绕荛蟯襓遶隢饒饶惹热熱人仁仞仭任刃刄壬妊姙屻忈忍忎扨朲杒栠栣梕涊牣祍秂秹稔紉紝絍綛纫纴肕腍芢荏荵菍衽袵訒認认讱躵軔轫鈓銋靭靱韌韧飪餁饪魜鵀仍扔礽芿辸陾囸日氜釰鈤馹驲傇冗坈媶嫆嬫宂容峵嵘嶸戎搈搑曧栄榕榮榵毧氄溶瀜烿熔爃狨瑢穁穃絨縙绒羢肜茙茸荣蓉蝾融螎蠑褣軵鎔镕駥髶媃宍揉柔楺渘煣瑈瓇禸粈糅肉腬葇蝚蹂輮鍒鞣騥鰇鶔乳侞偄儒入吺嗕嚅如媷孺帤扖挐擩曘杁桇汝洳渪溽濡筎縟缛肗臑茹蒘蓐蕠薷蠕袽褥襦辱鄏醹銣铷顬颥鱬鳰鴑鴽挼堧壖愞朊燸瑌瓀碝礝緛耎蝡軟輭软阮兊叡壡婑惢枘桵橤汭瑞甤睿緌繠芮蕊蕋蕤蘂蘃蚋蜹銳鋭锐橍润潤閏閠闰偌叒婼嵶弱捼撋楉渃焫爇箬篛若蒻鄀韖鰙鰯鶸仨卅挲摋撒栍櫒洒灑脎萨蕯薩虄訯鎝隡靸鞈颯飒馺僿嗮嘥噻塞揌毢簺腮賽赛顋鰓鳃三伞俕傘厁叁叄壭帴弎彡散毵毶毿氵潵犙糣糤繖鏒鏾閐饊馓鬖丧喪嗓搡桑桒槡磉褬鎟顙颡埽嫂慅扫掃掻搔氉溞瘙矂繅繰缫缲臊螦鄵鐰騒騷骚髞鰠鱢鳋啬嗇廧懎摵擌栜歮歰洓涩渋澀澁濇濏瀒琗瑟璱瘷穑穡穯粣繬色譅轖鉍銫鏼铯閪飋森椮槮篸襂僧縇鬙乷倽傻儍刹剎唦唼啥喢帹廈杀桬榝歃殺沙濈煞猀痧砂硰粆紗繺纱翜翣莎菨萐蔱裟鎩铩閯閷霎鯊鯋鲨攦晒曬筛篩簁諰骰䥇䦂䦅傓僐儃删刪剡剼善嘇圸埏墠墡姍姗嬗山幓扇挻搧撣擅攙敾晱杉栅椫樿檆櫼汕潸澘灗炶煔煽熌狦珊疝痁睒磰禪穇笘笧縿繕缮羴羶脠膳膻舢芟苫蔪蟮蟺衫覢訕謆譱讪贍赡赸跚軕邖鄯釤鐥钐閃閄閊闪陕陝顫饍騸骟鱔鳝\ue849\ue84c\ue84e丄上伤傷商坰垧埫墒尙尚恦愓慯扄晌殇殤滳熵緔绱蔏螪裳觞觴謪賞贘赏鋿鑜鬺劭勺卲哨娋少弰捎旓柖梢潲烧焼燒玿睄稍筲紹綤绍艄芍苕蕱袑輎邵韒韶髾鮹佘厍厙奢射弽慑慴懾挕捨揲摂摄攝檨欇歙涉涻渉滠灄猞畲磼社舌舍舎蔎虵蛇蛥蠂設设賒賖赊赦輋闍鞨韘騇麝誰什伔伸侁侺兟冞呻哂堔妽娠婶嫀嬸审宷審屾峷弞愼慎扟敒昚曋曑柛棯棽椹榊氠沈涁深渖渗滲瀋燊珅甚甡甧申瘆瘮眒眘瞫矤矧砷神祳穼籶籸糁糂糝紳绅罙罧肾胂脤腎葚葠蓡蔘薓蜃裑覾訠訷詵諗讅诜谂谉身邥鉮鋠頣駪魫鯅鯓鯵鰺鲹鵢偗剩剰勝升呏圣墭声娍嵊憴斘昇晟晠曻枡椉榺橳殅泩渻湦澠焺牲珄生甥盛省眚竔笙縄繉繩绳聖聲胜苼蕂譝貹賸鉎鍟阩陞陹鵿鼪䴓丆世丗乨亊事仕佦使侍兘冟势勢匙十卋叓史呞呩咶嗜噬埘塒士失奭始姼嬕实実室宲寔尸屍屎峕崼嵵市师師式弑弒忯恀恃拭拾揓敆施时旹是昰時枾柹柿栻榁榯氏浉湜湤湿溡溮溼澨濕炻烒煶狮獅瑡瓧畤眂眎眡睗矢石示礻祏竍笶笹筮篒簭籂籭絁舐舓莳葹蒒蒔蓍虱虲蚀蝕蝨褷襫襹視视觢試詩誓諟諡謚識识试诗谥豕貰贳軾轼辻适逝遈遞適遰遾邿酾釃釈释釋鈰鉂鉃鉐鉽鍦铈食飠飭飾餝饣饰駛驶鮖鯴鰘鰣鰤鲥鲺鳲鳾鶳鸤鼫鼭\ue85c兽収受售垨壽夀守寿手授收敊狩獣獸痩瘦綬绶膄艏醻首丨书侸倏倐叔塾墅姝婌孰尗属屬庶庻怷恕戍抒捈掓摅攄数暏暑曙書朮术束杸枢柕树梳樞樹橾殊殳毹毺氀沭淑漱潄潏潻澍濖瀭焂熟璹疎疏癙秫竖竪糬紓絉綀纾署腧舒荗菽蒁蔬薯虪蜀蠴術裋襡襩豎贖赎跾踈軗輸输述鄃錰鏣陎鮛鱪鱰鵨鶐鸀黍鼠刷唰耍誜選卛帅帥摔甩蟀衰拴栓槫涮腨閂闩双塽孀孇慡樉欆滝漺瀧灀爽礵縔艭鏯雙霜騻驦骦鷞鸘鹴娷帨水氺涗涚睡祱稅税脽裞說谁閖吮楯橓瞚瞤瞬舜蕣輴順顺鬊哾妁搠數朔槊烁爍獡矟硕碩箾蒴説说銏鎙鑠铄丝乺亖似佀佁価俟俬偲傂儩兕凘厮司咝嗣嘶噝四姒娰媤孠寺巳廝思恖愢撕斯柶楒榹死汜泀泗泤洍涘澌瀃牭祀禗禠禩私竢笥簛絲緦纟缌罳耜肂肆蕬蕼蛳螄蟖蟴覗貄釲鈶鈻鉰銯鋖鍶鐁锶颸飔飤飼饲駟騃騦驷鯐鷥鸶鼶㧐㩳倯傱凇娀宋崧嵩嵷庺忪怂悚愡愯慫憁憽捒松枀枩柗梥棇楤檧淞漎濍硹竦耸聳菘蘴蜙訟誦讼诵送鎹頌颂餸駷鬆\ue829\ue82a傁凁叜叟嗖嗽嗾廀廋捜搜摉摗擞擻櫢欶溲獀瘶瞍籔艘蒐蓃薮藪螋鄋醙鎪鏉锼颼颾飕餿馊騪俗傃僳嗉囌塐塑夙嫊宿愫愬憟梀棴榡樎樕橚櫯殐泝洬涑溯溸潚潥玊珟璛甦稣穌窣簌粛粟素縤縮肃肅膆苏蔌藗蘇蘓觫訴謖诉谡趚蹜速遡遬酥鋉餗驌骕鯂鱐鷫鹔匴狻痠祘笇筭算蒜酸亗倠哸埣夊嬘岁嵗旞檖歲歳毸浽滖澻濉瀡煫熣燧璲瓍眭睢砕碎祟禭穂穗穟簑綏縗繀繐繸绥缞脺芕荽荾葰虽襚誶譢谇賥遀遂邃鏸鐆鐩陏隋随隧隨雖靃鞖韢髄髓孙孫损損搎摌榫槂狲猻笋筍箰荪蓀蕵薞鎨隼飧飱鶽傞唆唢嗍嗦嗩娑嫅所挱摍暛桫梭溑溹獕琐琑瑣睃簔索缩羧莏蓑蜶褨趖逤鎈鎍鎖鎻鏁锁髿魦鮻㳠他侤嚃嚺塌塔墖她它崉挞搨撻榙榻橽毾沓涾溻澾濌牠狧獭獺祂禢粏褟襨誻譶趿踏蹋蹹躢逹遝遢錔鎉铊闒闥闧闼阘鞜鞳韃鮙鰨鳎\ue82f儓冭台咍囼坮太夳嬯孡忕忲态態抬擡斄旲枱檯汰泰溙漦炱炲燤箈籉肽胎臺舦苔菭薹跆軚邰酞鈦钛颱駘骀鮐鲐倓傝叹嗿嘆嘽嘾坍坛坦埮墰墵壇壜婒弹忐怹惔憛憳憻探摊撢擹攤昙暺曇榃橝檀歎毯湠滩潬潭灘炭璮痑痰瘫癱碳罈罎舑舕菼藫袒談譚譠谈谭貚貪賧贪赕郯醈醓醰鉭钽锬镡顃餤倘偒傏傥儻劏唐啺嘡坣堂塘嵣戃搪摥攩曭棠榶樘橖欓汤淌湯溏漟漡灙烫煻燙爣瑭矘磄禟篖簜糃糖糛羰耥膅膛蓎薚蘯蝪螗螳赯趟踼蹚躺逿鄌醣鎕鎲鏜鐋钂铴镋镗閶闛闣隚鞺餹饄饧鶶鼞咷啕套嫍幍弢慆掏搯桃槄洮涛涭淘滔濤焘燾瑫畓祹籌絛綢綯縚縧绦绹萄蜪裪討詜謟讨轁迯逃醄鋾錭陶鞀鞉鞱韜韬飸饀饕駣騊鼗忑慝特蚮螣蟘貣鋱鐡铽忒䲢儯幐朰滕漛疼痋籐籘縢腾藤虅誊謄邆霯駦騰驣鰧鼟\ue85b䴘体倜偍剃剔厗啼嗁嚏嚔奃媂媞屉屜崹徥徲悌悐惕惖惿戻扌挮掦提揥替梯殢涕渧漽珶瑅瓋碮磃稊籊綈緹绨缇罤苐蕛薙虒蝭蟬衹褅褆詆諦謕趧踢蹄蹏躰軆逖逷遆醍銻鍗锑題题騠骵體髢髰鬀鬄鮷鯷鳀鵜鶗鶙鷈鷉鷤鹈\ue861倎兲唺塡填天婖屇忝恬悿捵掭搷晪殄沺淟添湉琠璳甛甜田畋畑痶睓睼碵磌窴緂胋腆舔舚菾覥觍賟酟鈿錟錪钿闐阗靔靝靦顚餂鴫鷆鷏黇佻儵宨岧岹庣挑旫晀朓条條樤眺祒祧窕窱笤粜糶聎脁芀萔蓚蜩螩覜誂调趒跳迢銚鋚鎥铫鞗頫髫鯈鰷鲦齠龆呫帖惵萜蛈貼贴跕鉄鋨鐢鐵铁飻餮驖乭亭侱侹停厅厛听圢娗婷嵉庁庍庭廰廳廷挺梃楟榳汀涏渟濎烃烴烶珽筳綎耓聤聴聼聽脡艇莛葶蜓蝏誔諪邒鋌铤閮霆鞓頲颋鼮仝佟僮勭同哃嗵峂峝庝彤恸慟憅捅晍曈朣桐桶樋橦氃浵潼炵烔熥爞犝狪痌痛眮瞳砼硧秱童筒粡絧統綂统膧茼蓪蚒衕詷通酮鉖銅铜餇鮦鲖偷偸哣埱头妵婾投敨斢紏緰蘣諳透鈄鋀鍮钭頭黈兎兔冖凃凸吐唋啚図图圖圗土圡堍堗塗屠峹嵞嶀庩廜徒怢捸揬摕梌汢涂涋湥瑹痜瘏禿秃稌突筡腯荼莵菟葖蒤趃跿迌途酴釷鈯鋵鍎钍馟駼鵌鵚鵵鶟鷋鷵鼵剬团団圕團彖慱抟摶檲湍湪煓猯疃糰蓴褍褖貒鏄鶉鷒鷻俀僓墤娧尵推橔煺穨脮腿蓷藬蘈蛻蜕螁褪蹆蹪退隤頹頺頽颓駾騩骽吞呑噋囤坉屯庉忳暾朜氽焞畽膯臀臋芚蜳豘豚軘霕飩饨魨鲀黗佗侂侻咃咜唾坨堶妥媠嫷岮嶞庹托拓拕拖挩捝柁柝椭楕槖橐橢毤毻汑沰沱涶砣砤碢箨籜紽脫脱莌萚袉袥託詑讬跅跎踻軃酡鉈陀陁飥饦馱馲駄駝駞騨驒驮驼魠鮀鱓鴕鵎鸵鼉鼍鼧佤劸咓哇嗗嗢姽娃娲媧屲帓挖搲攨洼溛漥瓦瓲瓾畖砙穵窊窐窪聉腽膃蛙袜襪邷靺韈韎韤鼃㖞咼喎外崴歪瀤竵顡\ue81f万丸倇刓剜卍卐唍埦塆壪夗夘婉婠完宛岏帵弯彎忨惋抏挽捖捥掔晚晥晩晼杤梚椀槾汍涴湾潫灣烷玩琓琬畹皖盌睕瞣碗笂紈綄綩綰纨绾翫脘腕芄莬菀萬葂薍蜿蟃豌貦贃贎輐輓鄤鋄鋔錽鎫闗頑顽亡亾仼妄尣尩尪尫彺往徃忘忹惘旺暀望朢枉棢汪瀇王琞網网罒罓罔罖莣菵蚟蛧蝄誷輞辋魍为亹伟伪位偉偎偽僞儰卫危味唯喂喡喴囲围圍墛壝委威娓媁媙媦寪尉尾屗峗峞崣嵔嵬嶉嶶巍帏帷幃徫微恑惟愄愇慰懀捤揋揻撝撱斖暐未桅梶椲椳楲沩洈洧浘涠渨渭湋溈溦潍潙潿濰濻瀢炜為烓煒煟煨熭爲犚犩猥猬玮瑋璏瓗畏痿癐癓矀硊硙碨磈磑維緭緯縅纬维罻胃腲膸艉芛苇苿荱菋萎葦葨葳蒍蓶蔚蔿薇藯蘶蜲蜼蝛蝟螱衛衞褽覣覹詴諉謂讆讏诿谓趡踓躗躛軎轊违逶違遺鄬錗鍏鍡鏏闈闱隇隈隗霨霺霻韋韑韙韡韦韪頠颹餧餵饖骩骪骫魏鮇鮠鮪鰃鰄鰖鲔鳂鳚亠刎吻呅問塭妏彣忟抆揾搵文昷桽榲歾殟汶渂温溫炆玟珳瑥璺瘒瘟稳穏穩紊紋纹聞肳脕脗芠蕰薀蚉蚊螡蟁豱鎾閺閿闅闦问闻阌雯顐饂馼駇魰鰛鰮鳁鳼鴍鴖鼤嗡塕奣嵡攚暡滃瓮甕瞈罋翁聬蓊蕹螉鎓鶲鹟齆仴倭偓卧唩喔堝婐媉媼幄我挝捰握斡楃沃涡涹渥渦濣焥猧瓁瞃硪窝窩緺肟腛臥艧莴萵蒦薶蜗蝸踒踠雘齷龌乄乌五仵伆伍侮俉倵儛兀兦剭务務勿午吳吴吾呉呜唔啎嗚圬坞塢墲奦妩娬婺嫵寤屋屼岉嵍嵨巫幠庑廡弙忢忤怃悞悟悮憮戊扝扤捂摀敄无旿晤杇杌柮梧橆武毋汚污洖洿浯渞溩潕烏焐無熃熓物牾玝珷珸瑦璑甒痦矹碔祦窏窹箼粅膴舞芜芴茣莁蕪蘁蜈蝥螐蟱誈誣誤譕诬误躌迕逜邬鄔釫鋈鋘錻鎢钨阢陚隖雺雾霚霧靰騖骛鯃鰞鴮鵐鵡鶩鷡鹀鹉鹜鼯鼿齀习係俙傒僖兮凞匸卌卥厀吚吸呬唏唽喜喺嘻噏嚱囍塈墍壐夕奚媳嬆嬉宩屖屣屭嵠嶍嶲巂巇希席廗徆徔徙徯忚忥怬怸恄恓息悉悕惁惜愾憘憙戏戱戲扱昔晞晰晳暿曦杫析枲桸梻椞椺榽槢樨橀橲檄欯欷歚氥汐洗浠淅渓溪滊漇漝潟澙烯焁焈焟煕熂熄熙熹熺熻燍燨爔牺犀犔犠犧狶玺琋璽瓕瘜皙盻睎瞦矖矽硒碏磎磶礂禊禧稀稧穸窸粞糦系細綌緆縘縰繋繥纚细绤羲習翕翖聢肸肹膝舃舄舾莃菥葈葸蒠蒵蓆蓰蔇蕮虩蜤蜥蝷螅螇蟋蟢蠵衋袭裼襲西覡覤觋觹觽觿誒謵譆谿豀豨豯貕赥赩趇趘蹝躧邜郋郗郤鄎酅醯釐釳釸鈒鈢鉩錫鎴鏭鑴钑铣锡闟阋隙隟隰隵雟雭霫霼飁餏餙餼饎饩饻騱騽驨鬩鰼鱚鳛鵗鸂黖鼰鼳鼷丅下侠俠傄匣厦吓呷圷埉夏夓峡峽徦懗捾敮暇柙梺欱浹炠烚煆狎狭狹珨瑕疜瘕睱瞎硖硤碬磍祫筪縖罅翈舝舺芐蕸虾螛諕謑谺赮轄辖遐鍜鎋鎼鏬閕閜陜陿霞颬騢魻鰕鶷黠仙仚伣佡俔僊僩僲僴先冼县咞咸哯唌啣嘕垷埳壏奾姭姺娊娨娴娹婱嫌嫺嫻嬐孅宪尟尠屳岘峴幰廯弦忺憪憲憸懢挦掀搟撊攇攕显晛暹杴橌櫶欦毨氙涀涎湺澖瀗灦烍燹狝猃献獫獮獻玁现珗現甉痫癇癎盷県睍瞯瞷硍祆禒秈稴筅箲籼粯糮絤綅綫線繊纎纖纤线缐羡羨羬胘脇脋腺膁臔臤臽舷苋苮莧莶蔹薟藓藖蘚蘝蘞蚬蚿蛝蜆衔衘褼襳見誢誸諴譀譣豏賢贒贤赻跣跹蹮躚輱酰醎銑銜鋧錎鍁鍌锨閑闲限陥险陷険險霰韅韯韱顈顕顯餡馅馦鮮鱻鲜鶱鷳鷴鷼鹇鹹麲鼸⺈乡享亯佭像儴勨勷厢向响啌嚮夅姠嶑巷庠廂忀想晑曏栙楿橡欀湘潒珦瓖瓨相祥稥箱絴緗纕缃缿翔膷芗萫葙薌蚃蟓蠁衖襄襐詳详象跭迒郷鄉鄊鄕銄銗鐌鑲镶閧闀響項项飨餉饗饟饷香驤骧鬨鮝鯗鱌鱜鱶鲞麘侾俲傚削効咲哓哮啸嘋嘨嘯嘵嚣嚻囂婋孝宯宵小崤庨彇恔恷憢揱撓撨效敩斅斆晓暁曉枭枵校梟櫹歊歒歗毊洨消涍淆漻潇瀟灱灲焇熇熽燆燺猇獢痚痟皛皢硝硣穘窙笑筱筿箫篠簘簫綃绡翛肖膮莦萧萷蕭薂藃虈虓蛸蟂蟏蟰蠨訤詨誟誵謏謞謼譊踃轇逍郩銷销霄颵驍骁髇髐魈鴞鴵鵁鷍鸮些亵伳偕偞偰僁儶写冩劦勰协協卨卸嗋噧垥塮夑奊娎媟孈寫屃屑屓屟屧嶰廨徢恊愶慀懈拹挟挾揳搚携撷擕擷攜斜旪暬械楔榍榭樧歇泄泻洩渫湝澥瀉瀣灺炧炨烲焎熁燮燲爕猲獬瑎碿祄禼糏紲絬綊緳繲纈绁缬缷翓胁脅膎薢薤藛蝎蝢蟹蠍蠏衺褉褻襭觟諜諧謝讗谐谢躞躠邂邪鞋鞢鞵韰頁頡鬹魼鮭齂齘齛齥龤䜣伈伩信俽囟妡嬜孞廞心忄忻惞新昕杺枔欣歆炘焮盺礥脪舋芯莘薪衅訢訫軐辛邤釁鈊鋅鐔鑫锌阠顖馨馫馸鬵\ue844侀倖兴刑哘坙型垶塂姓娙婞嬹巠幸形性悻惺擤星曐杏洐涬煋狌猩瑆皨睲硎箵篂緈腥臖興荇荥莕蛵行裄觪觲謃邢郉醒鈃鉶銒鋞钘铏陉陘餳騂骍鯹兄兇凶匂匈哅忷恟汹洶焸熊熋胷胸芎訩詗詾讻诇賯赨雄休俢修咻嗅嚊岫峀庥朽樇溴滫潃烋烌珛琇璓秀糔綉繍繡绣羞脙脩臰臹苬茠蓨螑袖褏貅銝銹鎀鏅鏥鏽锈飍饈馐髤髹鮴鱃鵂鸺齅伵侐俆偦冔勖勗卹叙喣嘘嘼噓圩垿墟壻姁婿媭嬃序徐恤戌掝揟敍敘旭旴昫晇暊朂栩楈槒欨欰欻歔歘殈汿沀洫湑溆滀漵潊烅烼煦獝珝珬疞盢盨盱眗瞁矞禑稰稸窢糈絮綇続緒緖縃繻續绪续聓聟胥芧蒣蓄蓿蕦藚虗虚虛蝑裇訏許訹詡諝諿譃许诩谞賉鄦酗醑鉥銊鑐需須頊须顼驉鬚魆魖伭儇吅咺喧塇夐妶媗嫙宣怰悬愃愋懁懸揈揎敻旋昍昡晅暄暅暶梋楦檈泫渲漩澴炫烜煊狟獧玄玹琁琄瑄璇璿痃癣癬眩眴睻矎碹禤箮絃縣縼繏绚翧翾萱萲蓒蔙蕿藼蘐蜁蝖蠉衒袨諠諼譞谖贙軒轋轩选鉉鋗鍹鏇鐶铉镟镮鞙颴駽鰚乴噱坹学學岤峃嶨怴斈桖樰泧泬泶滈澩瀥燢狘疦疶瞲穴膤艝茓蒆薛血袕觷謔谑踅轌辪雤雪靴鞾鱈鳕鷽鸴伨侚偱勋勛勲勳卂咰噀噚嚑坃埙塤壎壦奞姰寻尋峋巡巺巽廵徇循恂愻揗撏攳旬曛杊栒桪樳殉殾毥汛洵浔潠濬灥焄煇熏燂燅燖燻爋狥獯珣璕畃矄紃絢纁臐荀荨葷蕁蕈薫薰蘍蟳襑訊訓訙詢训讯询賐迅迿逊遜鄩醺鑂顨馴駨驯鱏鱘鲟丫亚亜亞伢俹劜厊压厓呀哑唖啞圔圠圧垭埡堊堐壓姶娅婭孲岈崕崖庌庘押拁挜掗揠桠椏氩氬涯漄潝牙犽猚猰玡琊瓛疨痖瘂睚砑稏窫笌聐芽蕥蚜衙襾覀訝讶軈軋輵迓錏鐚铔雅鴉鴨鵪鵶鶕鸦鸭齖齾䜩䶮严乵俨偃偐偣傿儼兖兗剦匽厃厌厣厭厳厴咽唁啱喦喭噞嚥嚴囐堰塩墕壛壧夵奄妍妟姲姸娫娮媕嫣嬊嬮嬿孍宴岩崄崦嵃嵒嵓嵼嶖嶮巌巖巗巘巚延弇彥彦恹愝懕懨扊抁掞掩揅揜敥昖晏晻暥曕曮棪椻椼楌樮橪檐檿櫩沇沿淊淹渰渷湮溎滟演漹灎灔灧灩炎炏烟烻焉焑焔焰焱煙熖燄燕爓牪狿猒珚琂琰甗盐眼研砚硏硯硽碞礹筵篶簷綖縯罨胭腌臙艳艶艷莚菸萒葊葕蔅虤蜒蝘衍裺褗覎觃觾言訁訮詽諺讌讞讠谚谳豓豔贋贗赝躽軅遃郔郾鄢酀酽醃醶醼釅鉛閆閹閻閼闫阉阎阽隁隒雁顏顑顔顩颜餍饜騐験騴驗驠验鬳魇魘鰋鳫鴈鴳鶠鷃鷰鹽麙麣黡黤黫黬黭黶鼴鼹齞齴龑\ue845\ue863⺶仰佒佯傟养劷勜咉坱垟央姎婸岟崵崸徉怏恙慃懩扬抰揚攁敭旸昜暘杨样楊楧様樣歍殃氧氱泱洋漾瀁炀炴烊煬玚珜瑒疡痒瘍癢眏眻礢禓秧紻羊羏羕羪胦蛘蝆詇諹軮輰鉠鍚鐊钖阦阳陽雵霷鞅颺飏飬養駚鰑鴦鴹鸉鸯倄偠傜僥匋吆咬喓嗂垚堯夭妖姚婹媱宎尧尭岆峣崾嶢嶤幺徭徺恌愮抭揺搖摇摿暚曜曣杳枖柼楆榚榣殀殽溔滧烄烑熎燿爻狕猺獟玅珧瑤瑶皐眑矅磘祅穾窅窈窑窔窯窰筄繇纅耀肴腰舀艞苭药葯葽蕘薬藥蘨袎要覞訞詏謠謡讑谣趯軺轺遙遥邀鈅钥闄隃靿顤颻飖餆餚騕驁鰩鳐鴁鴢鷂鷕鹞鼼齩䥺业也亪亱倻僷冶叶吔啘嘢噎嚈埜墷壄夜峫嶪嶫抴掖揶擛擨擪擫晔暍曄曅曗曳曵枒枼枽椰楪業歋殗洂液漜潱澲烨熀燁爗爷爺瑘璍皣瞱瞸礏緤耶腋葉蠮謁谒邺鄓鄴野釾鋣鍱鎁鎑鐷铘靥靨页餣饁馌驜鵺鸈\ue84a一乁乂义乙亄亦亿以仪伇伊佚佾侇依俋倚偯儀億兿冝刈劓劮勚勩匇匜医呓呭呹咦咿唈噫囈圛圯坄垼埶埸墿壱壹夁夞夷奕姨媐嫕嫛嬄嬑嬟孴宐宜宧寱寲屹峄峓崺嶧嶬嶷已巸帟帠幆庡廙异弈弋弌弬彛彜彝彞彵役忆忔怈怡怿恞悒悘悥意憶懌懿戺扅扆抑挹揖搤撎攺敡敼斁旑旖易昳晹暆曀曎杙杝枍枻栘栧桋棭椅椬椸榏槸檍檥檹欥歖歝殔殪殹毅毉沂沶泆洟洢浂浥浳渏湙溢漪潩澺瀷炈焬焲熈熠熤熪熼燚燡燱狏猗獈玴珆瑿瓵畩異疑疫痍痬瘗瘞瘱癔益眙瞖矣礒礙祎禕移稦穓竩笖箷簃籎絏縊繄繶繹绎缢羛羠義羿翊翌翳翼耛耴肄肊胰膉臆舣艗艤艺芅苅苡苢荑萓萟蓺薏藙藝蘙虉蚁蛜蛡蛦蜴螔螘螠蟻衣衤衪衵袆袘袣裔裛裿褘褹襼觺訑訲訳詍詒詣誃誼謻譩譯議譺讉讛议译诒诣谊豙豛豷貖貤貽賹贀贻跇跠軼輗輢轙轶辥辷迆迤迱迻逘逸遗邑郼酏醫醳醷釔釴釶鈘鈠鉇鉯銕銥錡鎰鏔鐿钇铱镒镱阣陭隿霬靾頉頤頥顊顗颐飴饐饴駅驛驿骮鮧鮨鯣鳦鴺鶂鶃鶍鷁鷊鷖鷧鷾鸃鹝鹢鹥黓黟黳齮齸䲟乑乚伒侌凐印吟吲喑噖噾嚚囙因圁垔垠垽堙堷夤姻婣婬寅尹岃峾崟崯嶾廕廴引愔慇慭憖憗懚朄栶檃檭檼櫽欭歅殥殷氤泿洇洕淫淾湚溵滛潯濥濦烎犾狺猌玪珢璌瘖瘾癊癮碒磤禋秵窨筃粌絪緸胤膶苂茚茵荫荶蒑蔩蔭蘟蚓螾蟫裀訔訚訡誾諲讔赺趛鄞酓酳釿鈏鈝銀銦铟银闉阥阴陰陻隂隐隠隱霒霠霪靷鞇音韾飮飲饮駰骃鮣鷣齗齦龂龈\ue857俓偀僌営嘤噟嚶塋婴媖媵嫈嬰嬴孆孾嵤巆巊应廮影応愥應摬撄攍攖映暎朠柍桜桯梬楹樱櫻櫿泂浧渶溁溋滎滢潁潆濙濚濴瀅瀛瀠瀯瀴灐灜焽煐熒營珱瑛瑩璎瓔甇甖瘿癭盁盈矨硬碤礯穎籝籯緓縈纓绬缨罂罃罌膡膺英茔荧莹莺萤营萦萾蓥藀蘡蛍蝇蝧蝿螢蠅蠳褮覮謍譍譻賏贏赢迎郢鍈鎣鐛鑍锳霙韹韺頴颍颕颖鱦鴬鶑鶧鶯鷪鷹鸎鸚鹦鹰哟唷喲嚛佣俑傛傭勇勈咏喁嗈噰埇塎墉壅嫞嵱庸廱彮怺恿悀惥愑愹慂慵拥揘擁柡栐槦永泳涌湧滽澭灉牅用甬痈癕癰砽禜筩臃苚蒏蛹詠踊踴邕郺鄘醟鏞镛雍雝颙饔鯒鰫鱅鲬鳙鷛丣亴优佑侑偤優冘卣又友右呦哊唀嚘囿妋姷孧宥尢尤峟峳幼幽庮忧怞怣怮悠憂懮戭揂攸斿有柚梄梎楢槱櫌櫾汓沋油泑浟游湵滺瀀牖牗牰犹狖猶猷獶由甴疣痏祐禉秞糿纋羐羑羗耰聈肬脜苃莜莠莤莸蕕蚘蚰蚴蜏蝣蝤褎訧誘诱貁輏輶迶逌逰遊邎邮郵鄾酉酭釉鈾銪铀铕駀魷鮋鱿鲉麀黝鼬䱷䲣与予于亐伃伛余俁俞俣俼偊傴僪儥兪匬叞吁唹喅喩喻噊噳圄圉域堉堣堬墺妤妪娛娪娯娱媀媮嫗嬩宇寓寙屿峪峿崳嵎嵛嶎嶼庽庾彧御忬悆悇惐愈愉愚慾懙戫扜扵挧捓揄敔斞於旟昱杅栯桙棛棜棫楀楡楰榆櫲欎欝欤欲歈歟歶毓汙浴淢淤淯渔渝湡滪漁澞澦灪焴煜燏燠燰爩牏狱狳獄玉玗玙琙琟瑀瑜璵畬畭瘀瘉瘐癒盂盓睮砡硢硲礇礖礜祤禦禹禺秗稢稶穀穥穻窬窳竽箊篽籅籞籲粖紆緎纡罭羭羽翑聿肀育腴臾舁舆與艅艈芋芌茟茰萭萮萸蒮蓣蓹蕍蕷薁藇蘌蘛虞虶蜟蜮蝓蝺螸蟈衧袬裕褕覦觎誉語諛諭謣譽语谀谕豫貐踰軉輍輿轝込迂迃逳逾遇遹邘郁郚鄅酑醧釪鈺銉鋊鋙錥鍝鐍鐭钰铻閾阈陓隅隩雓雨雩霱預頨顒预飫餘饇饫馀馭騟驈驭骬髃鬰鬱鬻魊魚魣鮽鯲鰅鱊鱮鱼鳿鴥鴧鴪鵒鷠鷸鸆鸒鹆鹬麌齬龉\ue856\ue85a傆元円冤剈原厡厵员噮囦园圆圎園圓垣垸塬妧妴媛媴嫄嬽寃弲怨悁惌愿掾援杬棩楥榞榬橼櫞沅淵渁渆渊渕湲源溒灁爰猨猿獂瑗盶眢禐笎箢緣縁缘羱肙芫苑茒葾蒝蒬薗薳蚖蜎蝝蝯螈衏袁裫裷褑褤謜轅辕远逺遠邍邧酛鋺鎱院願駌騵魭鳶鴛鵷鶢鶰鸢鸳鹓黿鼋鼘鼝刖哕噦妜嬳岄岳嶽彟彠恱悅悦戉抈捳曰曱月枂栎樾櫟汋瀹爚玥矆矱礿禴箹篗籆籥籰粤粵約约臒蘥蚎蚏越跀跃躍軏鉞鑰钺閱閲阅髺鸑鸙黦龠龥云伝傊允勻匀員喗囩夽奫妘孕恽惲愠愪慍抎抣昀晕暈枟榅橒殒殞氲氳沄涒涢溳澐煴熅熉熨狁玧畇眃磒秐筼篔紜緷緼縕縜繧纭缊耘耺腪芸荺蒀蒕蒷蕓蕴藴蘊蜵蝹褞貟賱贇贠赟輼轀辒运運郓郧鄆鄖酝醖醞鈗阭陨隕雲霣鞰韗韞韫韵韻頵餫馧馻齫齳匝咂咋喒噈囋帀拶杂沞沯砸臜臢襍迊鉔雑雜雥韴魳仔傤儎再哉在宰崽扗栽洅渽溨災灾烖甾畠睵縡菑賳載载偺儧儹兂咱噆寁攒昝暂暫桚橵濽灒瓉瓒瓚禶穳簪簮糌襸讃讚賛贊赞趱趲蹔鄼酂酇錾鏨鏩鐕鐟饡匨塟奘弉欌牂羘脏臓臟臧葬蔵賍賘贓贜赃銺驡驵髒傮凿唕唣喿噪慥早枣栆梍棗澡灶煰燥璅璪皁皂竈簉糟艁薻藻蚤謲譟趮蹧躁造遭醩仄则則唶啧啫嘖嫧崱帻幘庂択择捑昃昗樍歵汄沢泎泽溭澤灂皟瞔矠硳礋稄笮箦簀舴蔶蘀蠌襗諎謮賾责赜迮鸅齚齰戝蠈賊贼鰂鱡鲗囎怎撍譖譛谮増增憎曽橧熷璔甑矰磳繒缯罾譄贈赠鄫鋥锃鱛乍偧剳劄吒咤哳喥喳奓宱扎抯拃挓揸搩搾札柞柵楂榨樝渣溠潳灹炸煠牐猹痄皶皻眨砟箑箚粂紥紮耫苲蚱蚻觰詐譇譗诈踷蹅轧醡鍘铡閘闸霅飵餷馇鮓鮺鲊鲝齄齇亝债債厏夈宅寨捚摘擇斋斎榸檡瘵砦窄翟豸責鉙骴齋偡占噡嫸展崭嵁嶃嶄嶘嶦怗惉战戦戰搌斩斬旃旜枬栈栴桟棧榐橏欃毡氈氊沾湛琖皽盏盞瞻碊站綻绽菚薝蘸虥虦蛅襢覱詀詹譧譫讝谵趈蹍輚輾轏辗邅醆閚霑颭飐飦餰饘驏驙魙鱣鳣鸇鹯黵丈仉仗仧傽墇嫜嶂帐帳幛幥张弡張彰慞扙掌暲杖樟涨涱漲漳獐璋痮瘬瘴瞕礃章粀粻胀脹蔁蟑賬账遧鄣長镸障鞝餦騿鱆麞佋兆召垗妱巶找招旐昭曌枛棹櫂沼炤照燳狣瑵盄瞾窼笊罀罩羄肁肇肈菬詔诏赵趙釗鉊鍣钊駋鮡鳭鼂鼌乇乛厇哲啠喆嗻嚞埑嫬悊扸折摺晢晣杔柘樜歽浙淛着矺砓磔籷粍者聑蔗虴蛰蜇螫蟄蟅袩褶襵詟謫謺讁讋谪赭輒輙轍辄辙这這遮銸鍺锗驝鮿鷓鹧侦侲偵圳塦姫嫃寊屒帧帪弫抮挋振揕搸敶斟旽昣朕枕枮栚桢桭楨榛槇槙樼殝沴浈湞潧澵獉珍珎瑧瑱甄甽畛疹眕眞真眹砧碪祯禎禛稹竧箴籈紖紾絼縝縥纼缜聄胗臻萙葴蒖蓁薽蜄袗裖覙診誫謓诊貞賑贞赈軫轃轸辴迧遉酖酙針鉁鋴錱鍖鍼鎭鎮针镇阵陣震靕駗鬒鱵鴆鸩黮黰鼑㊣䦛䦶争佂凧埥埩塣姃媜峥崝崢嶒幀幁征徎徰徴徵怔愸憕抍拯挣掙揁撜政整晸正炡烝爭狰猙症癥眐睁睜筝箏篜糽聇脀蒸証諍證证诤踭郑鄭鉦錚钲铮鬇鮏鯖鴊\ue851\ue853之伿侄俧倁値值偫儨凪制劕劧卮厔只吱呮咫址坁坧垁埴執墆墌妷姪娡嬂寘實峙崻巵帋帙帜幟庢庤廌彘徏徝志忮恉慹憄懥懫戠执扺扻抧拞挃指挚掷搘搱摨摭摯擲擳擿支斦旘旨晊智枝枳柣栀栉栺桎梔梽植椥楖榰槯樲樴櫍櫛止歭殖汁汥汦沚治洔洷淔淽滍滞滯漐潌潪瀄炙熫犆狾猘瓆瓡疐疷疻痔痣瘈直眰知砋礩祇祉祑祗祬禃禔禵秇秓秖秩秪秲秷稙稚稺穉窒筫紙紩絷絺綕緻縶織纸织置翐聀聁职聜職肢胑胝胵脂膣膱至致臷臸芖芝芷茋茝藢蘵蚔蛭蜘螲蟙衼袟袠製襧覟觗觝觯觶訨誌豑豒貭質贄质贽趾跖跱踬踯蹠蹢躑躓軄軹輊轵轾郅酯釞銍銴鋕鑕鑦铚锧阤阯陟隲隻雉馶馽駤騭騺驇骘鯯鳷鴙鴲鶨鷙鸷黹鼅中仲伀众偅冢刣堹塚妐妕媑尰幒彸徸忠斔柊歱汷泈炂煄狆瘇盅眾祌种種穜筗籦終緟终肿腫舯茽蔠蚛蝩螤螽衆衳衶衷諥踵蹱重鈆鈡銿鍾鐘钟锺鴤鼨㑇㑳㤘㥮伷侜僽冑周呪咒咮啁喌嚋妯婤宙州帚徟掫昼晝晭洀洲淍炿烐珘甃疛皱皺盩睭矪碡箒籀籒籕粙粥紂縐纣绉翢肘胄舟荮菷葤薵詋詶謅譸诌賙赒軸輈輖轴辀週郮酎銂霌駎駲騆驟骤鯞鵃鸼\ue81a\ue81b\ue824\ue825⺮㈱主伫佇住侏劚助劯嘱囑坾墸壴孎宔尌嵀帾拀拄敱敳斸曯朱杼枓柱柷株槠樦橥櫧櫫欘殶泏注洙渚潴濐瀦灟炢炷烛煑煮燭爥猪珠疰瘃眝瞩矚砫硃磩祝祩秼窋竚竹竺笁笜筑筯箸築篫篴紵紸絑纻罜羜翥舳苎茱茿莇著蓫蕏薥藷藸蛀蛛蝫蠋蠩蠾袾註詝誅諸诛诸豬貯贮跓跦躅軴迬逐逫邾鉒銖鋳鑄钃铢铸陼霔飳馵駐駯驻鮢鯺鱁鴸麆麈鼄抓摣撾檛爪爫簻膼髽拽捙睉跩轉䏝专僝剸叀啭囀堟塼嫥専專撰漙灷瑑瑼甎砖磗磚竱篆篿簨籑縳耑腞膞蒃蟤襈諯譔赚転转鄟顓颛饌馔鱄\ue83f壮壯壵妆妝娤幢庄庒戅戇撞桩梉樁湷漴焋状狀獞粧糚荘莊装裝坠墜惴椎甀畷礈笍箠綴縋缀缒腏膇諈贅赘轛追醀醊錐錣鑆锥隹餟騅骓魋鵻准凖啍圫埻宒湻準稕窀綧肫衠訰諄谆迍䦃丵倬剢劅卓啄啅噣圴妰娺彴拙捉捔撯擆擢斀斫斮斱斲斵晫桌梲棁棳椓槕櫡浊浞涿濁濯灼烵焯犳狵琸硺禚穛穱窡窧篧籗籱罬茁蓔蠗蠿諁諑謶诼酌鉵鋜鐯鐲镯鵫鷟\ue84d倳兹剚吇呰咨啙嗞嗭姉姊姕姿子字孜孳孶崰嵫恣杍栥梓椔榟橴沝淄渍湽滋滓漬澬牸璾眥眦矷禌秄秭秶稵穧笫籽紎紫緇缁耔胏胔胾自芓茊茡茲荢葘蓻薋虸訾訿諮谘貲資赀资赼趑趦輜輺辎鄑釨鈭錙鍿鎡锱镃頾頿髭鯔鰦鲻鶅鼒齍齜龇倊倧偬傯堫宗嵏嵕嵸总惣惾捴揔搃摠昮朡棕椶樅潀潈潨熜熧燪猔猣疭瘲碂磫稯粽糉綜緃総緫緵縂縦縱總繌纵综翪腙艐葼蓗蓯蝬豵踨踪蹤錝鍐鍯鏓鑁騌騣骔鬃鬉鬷鯮鯼奏媰揍搊棷棸箃緅芻諏诹走赱辵辶邹郰鄒鄹陬騶驺鯫鲰黀齱齺⻊伜伹俎倅卒哫唨崒崪族椊爼珇砠祖租箤組綷组菹葅蒩詛謯诅足踤踿鎐鏃镞阻靻顇駔劗揝攥欑篹籫繤纂纉纘缵賺躜躦鉆鑚鑽钻冣厜嗺嘴噿嫢嶊嶵晬最朘栬槜樶檇檌欈濢璻睟祽稡絊纗罪脧蕞蟕觜辠酔酨酻醉鋷錊僎僔噂尊嶟拵捘撙栫樽瀳繜罇袸譐踆遵銌鐏鱒鳟鶎鷷佐作侳做咗唑嘬坐岝岞左座怍捽昨琢祚秨稓穝筰糳繓胙莋葃葄蓙袏酢鈼鑿阼";
    public static final String LAST_PINYIN_UNIHAN = "咗";
    public static final String[] PINYINS;
    public static final SparseArray<char[]> POLYPHONE;
    public static final short POLYPHONE_FLAG = 16384;
    public static final String TAG = "HanziToPinyin";
    public static final char[] UNIHANS;
    public static final short[] UNIHANS_INDEX;
    public static final int VALUE_OF_0 = 48;
    public static final int VALUE_OF_9 = 57;
    public static final int VALUE_OF_LOWERCASE_A = 97;
    public static final int VALUE_OF_LOWERCASE_Z = 122;
    public static final int VALUE_OF_UPPERCASE_A = 65;
    public static final int VALUE_OF_UPPERCASE_Z = 90;
    public static HanziToPinyin sInstance;
    public transient /* synthetic */ FieldHolder $fh;
    public short[] PINYIN_TABLE;
    public final boolean mHasChinaCollator;

    /* loaded from: classes10.dex */
    public static class Token {
        public static /* synthetic */ Interceptable $ic = null;
        public static final int DIGIT = 3;
        public static final int LATIN = 1;
        public static final int PINYIN = 2;
        public static final String SEPARATOR = " ";
        public static final int SYMBOL = 4;
        public static final int UNKNOWN = 5;
        public transient /* synthetic */ FieldHolder $fh;
        public boolean isPolyphonic;
        public String[] polyphonicPinyins;
        public String source;
        public String target;
        public int type;

        public Token() {
            Interceptable interceptable = $ic;
            if (interceptable != null) {
                InitContext newInitContext = TitanRuntime.newInitContext();
                interceptable.invokeUnInit(65536, newInitContext);
                int i2 = newInitContext.flag;
                if ((i2 & 1) != 0) {
                    int i3 = i2 & 2;
                    newInitContext.thisArg = this;
                    interceptable.invokeInitBody(65536, newInitContext);
                }
            }
        }

        public Token(int i2, String str, String str2) {
            Interceptable interceptable = $ic;
            if (interceptable != null) {
                InitContext newInitContext = TitanRuntime.newInitContext();
                newInitContext.initArgs = r2;
                Object[] objArr = {Integer.valueOf(i2), str, str2};
                interceptable.invokeUnInit(65537, newInitContext);
                int i3 = newInitContext.flag;
                if ((i3 & 1) != 0) {
                    int i4 = i3 & 2;
                    newInitContext.thisArg = this;
                    interceptable.invokeInitBody(65537, newInitContext);
                    return;
                }
            }
            this.type = i2;
            this.source = str;
            this.target = str2;
        }
    }

    static {
        InterceptResult invokeClinit;
        ClassClinitInterceptable classClinitInterceptable = ClassClinitInterceptorStorage.$ic;
        if (classClinitInterceptable != null && (invokeClinit = classClinitInterceptable.invokeClinit(-1509916822, "Lcom/baidu/android/common/util/HanziToPinyin;")) != null) {
            Interceptable interceptable = invokeClinit.interceptor;
            if (interceptable != null) {
                $ic = interceptable;
            }
            if ((invokeClinit.flags & 1) != 0) {
                classClinitInterceptable.invokePostClinit(-1509916822, "Lcom/baidu/android/common/util/HanziToPinyin;");
                return;
            }
        }
        SparseArray<char[]> sparseArray = new SparseArray<>();
        POLYPHONE = sparseArray;
        sparseArray.put(38463, new char[]{21834, 39069});
        sparseArray.put(33406, new char[]{29233, 19968});
        sparseArray.put(33100, new char[]{30524, 21834});
        sparseArray.put(25303, new char[]{29275, 22885});
        sparseArray.put(25170, new char[]{25226, 24597});
        sparseArray.put(33152, new char[]{24110, 26049});
        sparseArray.put(34444, new char[]{24110, 23849});
        sparseArray.put(34180, new char[]{25253, 27874});
        sparseArray.put(22561, new char[]{21253, 26222, 19981});
        sparseArray.put(26292, new char[]{25253, 26222});
        sparseArray.put(33218, new char[]{24065, 20493});
        sparseArray.put(36767, new char[]{30382, 24065});
        sparseArray.put(25153, new char[]{21464, 29255});
        sparseArray.put(20415, new char[]{21464, 29255});
        sparseArray.put(39584, new char[]{26631, 31080});
        sparseArray.put(23631, new char[]{24179, 24182});
        sparseArray.put(21093, new char[]{27874, 25253});
        sparseArray.put(27850, new char[]{27874, 30772});
        sparseArray.put(20271, new char[]{27874, 30333});
        sparseArray.put(21340, new char[]{19981, 27874});
        sparseArray.put(21442, new char[]{24808, 23697, 36523});
        sparseArray.put(34255, new char[]{20179, 33039});
        sparseArray.put(26366, new char[]{23618, 22686});
        sparseArray.put(24046, new char[]{25554, 26612, 27425});
        sparseArray.put(21049, new char[]{26432, 25554});
        sparseArray.put(31109, new char[]{20135, 23665});
        sparseArray.put(39076, new char[]{20135, 31449});
        sparseArray.put(38271, new char[]{21809, 31456});
        sparseArray.put(26397, new char[]{36229, 25214});
        sparseArray.put(22066, new char[]{36229, 25214});
        sparseArray.put(36710, new char[]{25199, 21095});
        sparseArray.put(31216, new char[]{31243, 27785});
        sparseArray.put(20056, new char[]{31243, 29983});
        sparseArray.put(30427, new char[]{29983, 31243});
        sparseArray.put(28548, new char[]{31243, 28783});
        sparseArray.put(21273, new char[]{21313, 21507});
        sparseArray.put(37325, new char[]{20013, 34411});
        sparseArray.put(33261, new char[]{25277, 20241});
        sparseArray.put(30044, new char[]{20986, 38656});
        sparseArray.put(20256, new char[]{31359, 36716});
        sparseArray.put(32496, new char[]{36749, 36229});
        sparseArray.put(20282, new char[]{27425, 22235});
        sparseArray.put(26526, new char[]{20174, 24635});
        sparseArray.put(25874, new char[]{36190, 31388});
        sparseArray.put(25774, new char[]{38169, 22352});
        sparseArray.put(22823, new char[]{25171, 24102});
        sparseArray.put(21333, new char[]{20294, 20135, 38378});
        sparseArray.put(24377, new char[]{22363, 20294});
        sparseArray.put(25552, new char[]{26367, 24213});
        sparseArray.put(30340, new char[]{24503, 24213});
        sparseArray.put(37117, new char[]{35910, 35835});
        sparseArray.put(24230, new char[]{35835, 26421});
        sparseArray.put(22244, new char[]{33216, 21544});
        sparseArray.put(38761, new char[]{21733, 26426});
        sparseArray.put(21512, new char[]{27827, 21733});
        sparseArray.put(32473, new char[]{32102, 26426});
        sparseArray.put(39048, new char[]{32463, 32789});
        sparseArray.put(26552, new char[]{22815, 21095});
        sparseArray.put(35895, new char[]{21476, 38632});
        sparseArray.put(26727, new char[]{36149, 22238});
        sparseArray.put(34430, new char[]{30606, 21704});
        sparseArray.put(24055, new char[]{20687, 33322});
        sparseArray.put(21549, new char[]{22353, 33322});
        sparseArray.put(21644, new char[]{27827, 25143, 28779});
        sparseArray.put(35977, new char[]{27827, 37085});
        sparseArray.put(34425, new char[]{23439, 22870});
        sparseArray.put(20250, new char[]{22238, 22359});
        sparseArray.put(22855, new char[]{22120, 26426});
        sparseArray.put(32521, new char[]{26426, 22120});
        sparseArray.put(20552, new char[]{26426, 20511});
        sparseArray.put(31995, new char[]{27927, 26426});
        sparseArray.put(33540, new char[]{20999, 21152});
        sparseArray.put(22204, new char[]{20132, 32477});
        sparseArray.put(20389, new char[]{20132, 33647});
        sparseArray.put(35282, new char[]{20132, 32477});
        sparseArray.put(33050, new char[]{20132, 32477});
        sparseArray.put(21119, new char[]{20132, 36229});
        sparseArray.put(26657, new char[]{23567, 20132});
        sparseArray.put(35299, new char[]{20511, 35874});
        sparseArray.put(33445, new char[]{20511, 30422});
        sparseArray.put(34249, new char[]{20511, 26426});
        sparseArray.put(30684, new char[]{36827, 29748});
        sparseArray.put(21170, new char[]{36827, 26223});
        sparseArray.put(40863, new char[]{36149, 21531, 29699});
        sparseArray.put(21632, new char[]{21095, 22068});
        sparseArray.put(21345, new char[]{21652, 25488});
        sparseArray.put(22771, new char[]{21487, 26725});
        sparseArray.put(28889, new char[]{32769, 32599});
        sparseArray.put(21202, new char[]{21499, 31867});
        sparseArray.put(20457, new char[]{20486, 20142});
        sparseArray.put(28518, new char[]{32842, 32769});
        sparseArray.put(30860, new char[]{36335, 20845});
        sparseArray.put(20603, new char[]{27004, 21525});
        sparseArray.put(38706, new char[]{24405, 27004});
        sparseArray.put(25419, new char[]{21525, 32599});
        sparseArray.put(32511, new char[]{21525, 24405});
        sparseArray.put(20048, new char[]{21499, 26376});
        sparseArray.put(32476, new char[]{32599, 32769});
        sparseArray.put(33853, new char[]{32599, 32769, 36771});
        sparseArray.put(33033, new char[]{20080, 30952});
        sparseArray.put(22475, new char[]{20080, 24930});
        sparseArray.put(34067, new char[]{24930, 19975});
        sparseArray.put(27667, new char[]{24537, 26790});
        sparseArray.put(31192, new char[]{36855, 24517, 22791});
        sparseArray.put(27852, new char[]{36855, 24517});
        sparseArray.put(27169, new char[]{30952, 30446});
        sparseArray.put(25705, new char[]{30952, 39532});
        sparseArray.put(32554, new char[]{22937, 35884, 26576});
        sparseArray.put(24324, new char[]{20892, 40857});
        sparseArray.put(30111, new char[]{34384, 33647});
        sparseArray.put(23068, new char[]{25343, 35834});
        sparseArray.put(37027, new char[]{25343, 39297});
        sparseArray.put(20869, new char[]{39297, 25343});
        sparseArray.put(36843, new char[]{30772, 27966});
        sparseArray.put(32982, new char[]{26049, 30424});
        sparseArray.put(21032, new char[]{36305, 25253});
        sparseArray.put(28846, new char[]{36305, 21253});
        sparseArray.put(26420, new char[]{26222, 30772, 31080});
        sparseArray.put(28689, new char[]{26222, 25253});
        sparseArray.put(26333, new char[]{25253, 26222});
        sparseArray.put(26646, new char[]{22120, 35199});
        sparseArray.put(36426, new char[]{22120, 35199});
        sparseArray.put(31293, new char[]{26426, 22120});
        sparseArray.put(33640, new char[]{23547, 38065});
        sparseArray.put(33564, new char[]{21069, 35199});
        sparseArray.put(24378, new char[]{25250, 22870});
        sparseArray.put(36228, new char[]{20999, 21095});
        sparseArray.put(20146, new char[]{29748, 35831});
        sparseArray.put(38592, new char[]{32570, 26725});
        sparseArray.put(33394, new char[]{28073, 36187});
        sparseArray.put(22622, new char[]{36187, 28073});
        sparseArray.put(21414, new char[]{19979, 26432});
        sparseArray.put(26441, new char[]{23665, 26432});
        sparseArray.put(25240, new char[]{36825, 35774});
        sparseArray.put(20160, new char[]{28145, 21313});
        sparseArray.put(33882, new char[]{28145, 20154});
        sparseArray.put(35782, new char[]{21313, 21482});
        sparseArray.put(20284, new char[]{22235, 21313});
        sparseArray.put(29087, new char[]{21460, 25910});
        sparseArray.put(34731, new char[]{36825, 21313});
        sparseArray.put(35828, new char[]{30805, 30561});
        sparseArray.put(25968, new char[]{21460, 30805});
        sparseArray.put(32553, new char[]{25152, 32032});
        sparseArray.put(35843, new char[]{36339, 21514});
        sparseArray.put(22313, new char[]{39035, 26410});
        sparseArray.put(23614, new char[]{26410, 19968});
        sparseArray.put(23561, new char[]{26410, 40060});
        sparseArray.put(21523, new char[]{19979, 27827});
        sparseArray.put(35265, new char[]{38388, 29616});
        sparseArray.put(32420, new char[]{20808, 38065});
        sparseArray.put(34892, new char[]{24615, 33322, 27178});
        sparseArray.put(30465, new char[]{29983, 24615});
        sparseArray.put(23487, new char[]{33487, 20241});
        sparseArray.put(21066, new char[]{31505, 38634});
        sparseArray.put(34880, new char[]{38634, 20889});
        sparseArray.put(27575, new char[]{22240, 30524});
        sparseArray.put(21693, new char[]{30524, 19994});
        sparseArray.put(38053, new char[]{35201, 26376});
        sparseArray.put(21494, new char[]{19994, 35874});
        sparseArray.put(29096, new char[]{20113, 40060});
        sparseArray.put(21505, new char[]{40060, 39035});
        sparseArray.put(31584, new char[]{21531, 20113});
        sparseArray.put(25321, new char[]{21017, 25688});
        sparseArray.put(25166, new char[]{28856, 26434});
        sparseArray.put(36711, new char[]{28856, 20122});
        sparseArray.put(31896, new char[]{24180, 31449});
        sparseArray.put(30528, new char[]{36825, 25214, 26700});
        sparseArray.put(27542, new char[]{21482, 21313});
        sparseArray.put(23646, new char[]{21460, 29482});
        sparseArray.put(33879, new char[]{20303, 36825, 26700});
        sparseArray.put(24162, new char[]{35013, 21019});
        sparseArray.put(32508, new char[]{24635, 36192});
        sparseArray.put(26590, new char[]{28856, 20570});
        UNIHANS = new char[]{21393, 20236, 20370, 21356, 20658, 20023, 20336, 20276, 20621, 20328, 17329, 20532, 22051, 20298, 20415, 20469, 21029, 20647, 19993, 20147, 19981, 22163, 20082, 16735, 11915, 22024, 20391, 21445, 20093, 20187, 20394, 20019, 20201, 20198, 20566, 20545, 19998, 20268, 20805, 17207, 20109, 18847, 20018, 20489, 20501, 19616, 21852, 20282, 19995, 20945, 20419, 24017, 20092, 20383, 21065, 20131, 20195, 20025, 20741, 20498, 22042, 25189, 20700, 20222, 22002, 20022, 20228, 21472, 19969, 19999, 19996, 20071, 20959, 20595, 20812, 20229, 20152, 20420, 27448, 21999, 38821, 20091, 20047, FIRST_UNIHAN, 20223, 11908, 20221, 20016, 20175, 21542, 20032, 20285, 19984, 20089, 14799, 21186, 20010, 32102, 20120, 20121, 11927, 20317, 20272, 20878, 20054, 20492, 11916, 20096, 24771, 21871, 21704, 20068, 11955, 22451, 20624, 20309, 22079, 20343, 20069, 20188, 20399, 20042, 21010, 22351, 21796, 20575, 15470, 20434, 20249, 19980, 20215, 20214, 20619, 19732, 20015, 20165, 19734, 20400, 20009, 19735, 20518, 18822, 20426, 20327, 20975, 20075, 20130, 19970, 20811, 21067, 21827, 20076, 20517, 20902, 20424, 20361, 14815, 23485, 20017, 17996, 22256, 24275, 21068, 20358, 20683, 21190, 20332, 20048, 20651, 20919, 20029, 20457, 20151, 20001, 20698, 19733, 20020, 12295, 20845, 21679, 20785, 16470, 20371, 20081, 22297, 20177, 20526, 20387, 20620, 20080, 20680, 21398, 20867, 20040, 20930, 20204, 20762, 20366, 19983, 20207, 20060, 20726, 20338, 35628, 20078, 20372, 20137, 20088, 20035, 20413, 20074, 21272, 21602, 20839, 23174, 31452, 20273, 21316, 23064, 23243, 21870, 22236, 20318, 11943, 20396, 21826, 20246, 22907, 23145, 20649, 22899, 20079, 20598, 17324, 20467, 20012, 20051, 21032, 20226, 21600, 20283, 19737, 20559, 20676, 20031, 21697, 20050, 18813, 20858, 20166, 19971, 20729, 20094, 21595, 20052, 19988, 20146, 18300, 17622, 19617, 20297, 20346, 21364, 22229, 20868, 22199, 23046, 24825, 20154, 20173, 22264, 20615, 23171, 20083, 25404, 22567, 20810, 27213, 20556, 20200, 20735, 19977, 20007, 22525, 21868, 26862, 20711, 20087, 25894, 18759, 19972, 21165, 20312, 35504, 20160, 20567, 19731, 20861, 20008, 21047, 21339, 25332, 21452, 23095, 21550, 21758, 19997, 14800, 20609, 20439, 21300, 20119, 23385, 20638, 15584, 20755, 20499, 20504, 21687, 24529, 24530, 19618, 19736, 20494, 20347, 21611, 20077, 20189, 20599, 20814, 21100, 20416, 21534, 20311, 20324, 13726, 19975, 20129, 20026, 20128, 21985, 20212, 20036, 20064, 19973, 20185, 11912, 20414, 20123, 18211, 20352, 20804, 20241, 20277, 20269, 20084, 20264, 20011, 18217, 11958, 20484, 18810, 19968, 19615, 20435, 21727, 20323, 20003, 19575, 20614, 21014, 20113, 21277, 20180, 20602, 21288, 20654, 20164, 25117, 22222, 22679, 20045, 20125, 20577, 19976, 20299, 20039, 20390, 12963, 20043, 20013, 13383, 11950, 25235, 25341, 17373, 22766, 22368, 20934, 18819, 20531, 20490, 22863, 11978, 21143, 20899, 20686, 20304};
        UNIHANS_INDEX = new short[]{0, 7, 65, 113, 122, 174, 227, 250, 291, 321, 384, 444, 466, 486, 630, 692, 738, 758, 798, 844, 939, 985, 992, 1017, 1050, 1069, 1093, 1113, 1119, 1129, 1169, 1186, 1271, 1332, 1362, 1387, 1443, 1531, 1633, 1662, 1709, 1786, 1796, 1821, 1845, 1864, 1906, 1927, 1983, 2032, 2038, 2066, 2085, 2119, 2132, 2167, 2212, 2258, 2345, 2387, 2441, 2454, 2456, 2483, 2592, 2593, 2647, 2693, 2737, 2780, 2785, 2841, 2878, 2945, 2970, 3000, 3037, 3100, 3211, 3213, 3220, 3221, 3273, 3307, 3387, 3425, 3500, 3576, 3649, 3653, 3661, 3878, 3891, 3926, 3987, 4022, 4067, 4129, 4131, 4139, 4172, 4217, 4263, 4354, 4382, 4393, 4450, 4478, 4559, 4577, 4624, 4637, 4663, 4757, 4774, 4831, 4920, 4924, 4933, 4957, 5036, 5073, 5205, 5258, 5274, 5355, 5424, 5562, 5596, 5656, 5942, 6025, 6224, 6288, 6411, 6551, 6643, 6749, 6781, 6845, 7001, 7047, 7139, 7196, 7209, 7248, 7281, 7308, 7327, 7409, 7411, 7423, 7442, 7459, 7484, 7518, 7533, 7562, 7573, 7630, 7715, 7768, 7796, 7831, 7881, 7962, 8000, 8052, 8073, 8144, 8154, 8383, 8385, 8474, 8522, 8583, 8632, 8710, 8803, 8886, 8888, 8951, 8996, 9159, 9193, 9202, 9237, 9313, 9371, 9413, 9437, 9479, 9514, 9570, 9577, 9653, 9677, 9732, 9816, 9862, 9892, 9916, 9973, 10003, 10005, 10094, 10113, 10167, 10199, 10220, 10247, 10261, 10294, 10302, 10313, 10318, 10321, 10397, 10429, 10435, 10450, 10502, 10506, 10539, 10557, 10584, 10595, 10611, 10617, 10622, 10648, 10658, 10663, 10696, 10718, 10736, 10784, 10816, 10850, 10888, 10899, 10968, 11088, 11122, 11156, 11167, 11196, 11251, 11299, 11314, 11373, 11587, 11607, 11748, 11811, 11894, 11936, 12019, 12085, 12119, 12205, 12322, 12399, 12435, 12451, 12475, 12494, 12510, 12513, 12571, 12577, 12584, 12633, 12656, 12704, 12705, 12721, 12746, 12752, 12772, 12794, 12808, 12835, 12847, 12873, 12908, 12913, 12916, 12959, 12967, 13065, 13099, 13132, 13179, 13180, 13280, 13335, 13518, 13542, 13646, 13651, 13658, 13665, 13689, 13704, 13716, 13736, 13828, 13879, 13918, 13986, 13995, 14063, 14085, 14125, 14182, 14229, 14304, 14383, 14438, 14448, 14449, 14473, 14566, 14624, 14670, 14686, 14740, 14799, 14820, 14886, 14910, 14939, 14966, 15042, 15081, 15091, 15174, 15213, 15410, 15478, 15498, 15544, 15693, 15951, 16024, 16219, 16308, 16429, 16560, 16608, 16670, 16694, 16748, 16868, 16964, 17009, 17107, 17191, 17434, 17526, 17649, 17737, 18113, 18257, 18400, 18404, 18476, 18598, 18900, 19012, 19073, 19178, 19200, 19224, 19265, 19287, 19322, 19371, 19378, 19384, 19404, 19473, 19496, 19576, 19628, 19672, 19734, 19851, 19921, 20179, 20242, 20328, 20470, 20479, 20484, 20529, 20556, 20588, 20605, 20676, 20775, 20847, 20874, 20911, 20929, 20965, 20988};
        PINYINS = new String[]{"A", "Ai", "An", "Ang", "Ao", "Ba", "Bai", "Ban", "Bang", "Bao", "Bei", "Ben", "Beng", "Bi", "Bian", "Biao", "Bie", "Bin", "Bing", "Bo", "Bu", "Ca", "Cai", "Can", "Cang", "Cao", "Ce", "Cen", "Ceng", "Cha", "Chai", "Chan", "Chang", "Chao", "Che", "Chen", "Cheng", "Chi", "Chong", "Chou", "Chu", "Chuai", "Chuan", "Chuang", "Chui", "Chun", "Chuo", "Ci", "Cong", "Cou", "Cu", "Cuan", "Cui", "Cun", "Cuo", "Da", "Dai", "Dan", "Dang", "Dao", "De", "Den", "Deng", "Di", "Dia", "Dian", "Diao", "Die", "Ding", "Diu", "Dong", "Dou", "Du", "Duan", "Dui", "Dun", "Duo", "E", "Ei", "En", "Eng", "Er", "Fa", "Fan", "Fang", "Fei", "Fen", "Feng", "Fo", "Fou", "Fu", "Ga", "Gai", "Gan", "Gang", "Gao", "Ge", "Gei", "Gen", "Geng", "Gong", "Gou", "Gu", "Gua", "Guai", "Guan", "Guang", "Gui", "Gun", "Guo", "Ha", "Hai", "Han", "Hang", "Hao", "He", "Hei", "Hen", "Heng", "Hong", "Hou", "Hu", "Hua", "Huai", "Huan", "Huang", "Hui", "Hun", "Huo", "Ji", "Jia", "Jian", "Jiang", "Jiao", "Jie", "Jin", "Jing", "Jiong", "Jiu", "Ju", "Juan", "Jue", "Jun", "Ka", "Kai", "Kan", "Kang", "Kao", "Ke", "Kei", "Ken", "Keng", "Kong", "Kou", "Ku", "Kua", "Kuai", "Kuan", "Kuang", "Kui", "Kun", "Kuo", "La", "Lai", "Lan", "Lang", "Lao", "Le", "Lei", "Leng", "Li", "Lia", "Lian", "Liang", "Liao", "Lie", "Lin", "Ling", "Liu", "Lo", "Long", "Lou", "Lu", "Luan", "Lue", "Lun", "Luo", "Lv", "Ma", "Mai", "Man", "Mang", "Mao", "Me", "Mei", "Men", "Meng", "Mi", "Mian", "Miao", "Mie", "Min", "Ming", "Miu", "Mo", "Mou", "Mu", "Na", "Nai", "Nan", "Nang", "Nao", "Ne", "Nei", "Nen", "Neng", "Ni", "Nian", "Niang", "Niao", "Nie", "Nin", "Ning", "Niu", "Nong", "Nou", "Nu", "Nuan", "Nue", "Nuo", "Nv", "O", "Ou", "Pa", "Pai", "Pan", "Pang", "Pao", "Pei", "Pen", "Peng", "Pi", "Pian", "Piao", "Pie", "Pin", Ping.TAG, "Po", "Pou", "Pu", "Qi", "Qia", "Qian", "Qiang", "Qiao", "Qie", "Qin", "Qing", "Qiong", "Qiu", "Qu", "Quan", "Que", "Qun", "Ran", "Rang", "Rao", "Re", "Ren", "Reng", "Ri", "Rong", "Rou", "Ru", "Rua", "Ruan", "Rui", "Run", "Ruo", "Sa", "Sai", "San", "Sang", "Sao", "Se", "Sen", "Seng", "Sha", "Shai", "Shan", "Shang", "Shao", "She", "Shei", "Shen", "Sheng", "Shi", "Shou", "Shu", "Shua", "Shuai", "Shuan", "Shuang", "Shui", "Shun", "Shuo", "Si", "Song", "Sou", "Su", "Suan", "Sui", "Sun", "Suo", "Ta", "Tai", "Tan", "Tang", "Tao", "Te", "Tei", "Teng", "Ti", "Tian", "Tiao", "Tie", "Ting", "Tong", "Tou", "Tu", "Tuan", "Tui", "Tun", "Tuo", "Wa", "Wai", "Wan", "Wang", "Wei", "Wen", "Weng", "Wo", "Wu", "Xi", "Xia", "Xian", "Xiang", "Xiao", "Xie", "Xin", "Xing", "Xiong", "Xiu", "Xu", "Xuan", "Xue", "Xun", "Ya", "Yan", "Yang", "Yao", "Ye", "Yi", "Yin", "Ying", "Yo", "Yong", "You", "Yu", "Yuan", "Yue", "Yun", "Za", "Zai", "Zan", "Zang", "Zao", "Ze", "Zei", "Zen", "Zeng", "Zha", "Zhai", "Zhan", "Zhang", "Zhao", "Zhe", "Zhen", "Zheng", "Zhi", "Zhong", "Zhou", "Zhu", "Zhua", "Zhuai", "Zhuan", "Zhuang", "Zhui", "Zhun", "Zhuo", "Zi", "Zong", "Zou", "Zu", "Zuan", "Zui", "Zun", "Zuo"};
    }

    /* JADX DEBUG: Failed to insert an additional move for type inference into block B:24:0x0028 */
    /* JADX WARN: Multi-variable type inference failed */
    /* JADX WARN: Type inference failed for: r3v4, types: [short] */
    /* JADX WARN: Type inference failed for: r3v5, types: [int] */
    /* JADX WARN: Type inference failed for: r3v6, types: [int] */
    public HanziToPinyin(boolean z) {
        Interceptable interceptable = $ic;
        if (interceptable != null) {
            InitContext newInitContext = TitanRuntime.newInitContext();
            newInitContext.initArgs = r2;
            Object[] objArr = {Boolean.valueOf(z)};
            interceptable.invokeUnInit(65537, newInitContext);
            int i2 = newInitContext.flag;
            if ((i2 & 1) != 0) {
                int i3 = i2 & 2;
                newInitContext.thisArg = this;
                interceptable.invokeInitBody(65537, newInitContext);
                return;
            }
        }
        short[] sArr = new short[65535];
        this.PINYIN_TABLE = sArr;
        this.mHasChinaCollator = z;
        Arrays.fill(sArr, (short) -1);
        short s = 0;
        while (true) {
            short[] sArr2 = UNIHANS_INDEX;
            if (s >= sArr2.length) {
                break;
            }
            int i4 = s + 1;
            short s2 = i4 == sArr2.length ? (short) 21021 : sArr2[i4];
            for (short s3 = sArr2[s]; s3 < s2; s3++) {
                this.PINYIN_TABLE[HANZI.charAt(s3) & CharCompanionObject.MAX_VALUE] = s;
            }
            s = (short) i4;
        }
        int size = POLYPHONE.size();
        for (int i5 = 0; i5 < size; i5++) {
            short[] sArr3 = this.PINYIN_TABLE;
            int keyAt = ((char) POLYPHONE.keyAt(i5)) & CharCompanionObject.MAX_VALUE;
            sArr3[keyAt] = (short) (sArr3[keyAt] | POLYPHONE_FLAG);
        }
    }

    private void addToken(StringBuilder sb, ArrayList<Token> arrayList, int i2) {
        Interceptable interceptable = $ic;
        if (interceptable == null || interceptable.invokeLLI(65538, this, sb, arrayList, i2) == null) {
            String sb2 = sb.toString();
            arrayList.add(new Token(i2, sb2, sb2));
            sb.setLength(0);
        }
    }

    private boolean buildPolyphonicToken(Token token, char c2) {
        InterceptResult invokeCommon;
        Interceptable interceptable = $ic;
        if (interceptable == null || (invokeCommon = interceptable.invokeCommon(65539, this, new Object[]{token, Character.valueOf(c2)})) == null) {
            char[] cArr = POLYPHONE.get(c2);
            if (cArr == null) {
                return false;
            }
            int length = cArr.length;
            String[] strArr = new String[length];
            for (int i2 = length - 1; i2 >= 0; i2--) {
                if (POLYPHONE.indexOfKey(cArr[i2]) > 0) {
                    String str = c2 + " links to a polyphone: " + cArr[i2] + "!!";
                }
                strArr[i2] = getToken(cArr[i2], true).target;
            }
            token.type = 2;
            token.target = strArr[0];
            token.isPolyphonic = true;
            token.polyphonicPinyins = strArr;
            return true;
        }
        return invokeCommon.booleanValue;
    }

    public static String buildUnihansIndex() {
        InterceptResult invokeV;
        Interceptable interceptable = $ic;
        if (interceptable == null || (invokeV = interceptable.invokeV(InputDeviceCompat.SOURCE_TRACKBALL, null)) == null) {
            String str = "";
            for (int i2 = 0; i2 < UNIHANS.length; i2++) {
                str = str + HANZI.indexOf(UNIHANS[i2]);
                if (i2 != UNIHANS.length - 1) {
                    str = str + StringUtil.ARRAY_ELEMENT_SEPARATOR;
                }
            }
            return str;
        }
        return (String) invokeV.objValue;
    }

    public static HanziToPinyin getInstance() {
        InterceptResult invokeV;
        Interceptable interceptable = $ic;
        if (interceptable == null || (invokeV = interceptable.invokeV(65541, null)) == null) {
            synchronized (HanziToPinyin.class) {
                if (sInstance != null) {
                    return sInstance;
                }
                HanziToPinyin hanziToPinyin = new HanziToPinyin(true);
                sInstance = hanziToPinyin;
                return hanziToPinyin;
            }
        }
        return (HanziToPinyin) invokeV.objValue;
    }

    private Token getToken(char c2, boolean z) {
        InterceptResult invokeCommon;
        Interceptable interceptable = $ic;
        if (interceptable == null || (invokeCommon = interceptable.invokeCommon(65542, this, new Object[]{Character.valueOf(c2), Boolean.valueOf(z)})) == null) {
            Token token = new Token();
            String ch = Character.toString(c2);
            token.source = ch;
            if (c2 < 256) {
                token.type = 1;
                token.target = ch;
                return token;
            } else if (c2 < 11905) {
                token.type = 5;
                token.target = ch;
                return token;
            } else {
                short s = this.PINYIN_TABLE[65535 & c2];
                boolean z2 = (s & POLYPHONE_FLAG) > 0;
                short s2 = (short) (s & (-16385));
                if (z2 && !z && buildPolyphonicToken(token, c2)) {
                    return token;
                }
                if (s2 < 0) {
                    token.type = 5;
                    token.target = ch;
                    return token;
                }
                token.type = 2;
                token.target = PINYINS[s2];
                return token;
            }
        }
        return (Token) invokeCommon.objValue;
    }

    public static boolean isDefined(int i2) {
        InterceptResult invokeI;
        Interceptable interceptable = $ic;
        return (interceptable == null || (invokeI = interceptable.invokeI(65543, null, i2)) == null) ? HANZI.indexOf(i2) >= 0 : invokeI.booleanValue;
    }

    public static boolean isDigit(int i2) {
        InterceptResult invokeI;
        Interceptable interceptable = $ic;
        return (interceptable == null || (invokeI = interceptable.invokeI(65544, null, i2)) == null) ? i2 >= 48 && i2 <= 57 : invokeI.booleanValue;
    }

    public static boolean isEnglishLetter(int i2) {
        InterceptResult invokeI;
        Interceptable interceptable = $ic;
        if (interceptable == null || (invokeI = interceptable.invokeI(65545, null, i2)) == null) {
            if (i2 < 97 || i2 > 122) {
                return i2 >= 65 && i2 <= 90;
            }
            return true;
        }
        return invokeI.booleanValue;
    }

    public ArrayList<Token> get(String str) {
        InterceptResult invokeL;
        Interceptable interceptable = $ic;
        if (interceptable == null || (invokeL = interceptable.invokeL(1048576, this, str)) == null) {
            ArrayList<Token> arrayList = new ArrayList<>();
            if (this.mHasChinaCollator && str != null && str.length() != 0) {
                int length = str.length();
                StringBuilder sb = new StringBuilder();
                int i2 = 1;
                for (int i3 = 0; i3 < length; i3++) {
                    char charAt = str.charAt(i3);
                    if (charAt < 256) {
                        int i4 = 3;
                        if (isEnglishLetter(charAt)) {
                            if (i2 != 1 && sb.length() > 0) {
                                addToken(sb, arrayList, i2);
                            }
                            i4 = 1;
                        } else if (isDigit(charAt)) {
                            if (i2 != 3 && sb.length() > 0) {
                                addToken(sb, arrayList, i2);
                            }
                        } else {
                            if (i2 != 4 && sb.length() > 0) {
                                addToken(sb, arrayList, i2);
                            }
                            i4 = 4;
                        }
                        sb.append(charAt);
                        i2 = i4;
                    } else if (charAt < 11905) {
                        if (i2 != 5 && sb.length() > 0) {
                            addToken(sb, arrayList, i2);
                        }
                        sb.append(charAt);
                        i2 = 5;
                    } else {
                        Token token = getToken(charAt, false);
                        int i5 = token.type;
                        if (i5 == 2) {
                            if (sb.length() > 0) {
                                addToken(sb, arrayList, i2);
                            }
                            arrayList.add(token);
                            i2 = 2;
                        } else {
                            if (i2 != i5 && sb.length() > 0) {
                                addToken(sb, arrayList, i2);
                            }
                            i2 = token.type;
                            sb.append(charAt);
                        }
                    }
                }
                if (sb.length() > 0) {
                    addToken(sb, arrayList, i2);
                }
            }
            return arrayList;
        }
        return (ArrayList) invokeL.objValue;
    }
}
